{
  "sections": [{
    "heading": "1 The SIR Model",
    "text": ""
  }, {
    "heading": "1.1 The SIR model without vital dynamics",
    "text": "The dynamics of an epidemic, for example the Influenza—flu, are often much faster than the dynamics of birth and death, therefore, birth and death are often omitted in simple compartmental models. The SIR system without socalled vital dynamics (birth and death, sometimes called demography) described above can be expressed by the following set of ordinary differential equations:\ndS dt = −βIS N (1)\n,\ndI dt = βIS N − γI (2)\n,\ndR\ndt = γI (3)\n. Where S is the stock of susceptible population, I is the stock of infected, and R is the stock of recovered population. This model was for the first time proposed by O. Kermack and Anderson Gray McKendrick as a special case of what we now call Kermack-McKendrick theory, and followed work McKendrick had done with Ronald Ross.\nThis system is non-linear, and does not admit a generic analytic solution. Nevertheless, significant results can be derived analytically, and with Monte Carlo methods, such as the Gillespie algorithm.\nFirstly note that from:\ndS dt + dI dt + dR dt = 0 (4)\n, it follows that:\nS(t) + I(t) +R(t) = Constant = N (5)\n, expressing in mathematical terms the constancy of population N . Note that the above relationship implies that one need only study the equation for two of the three variables.\nSecondly, we note that the dynamics of the infectious class depends on the following ratio:\nR0 = β\nγ (6)\n, the so-called basic reproduction number (also called basic reproduction ratio). This ratio is derived as the expected number of new infections (these new infections are sometimes called secondary infections) from a single infection in a population where all subjects are susceptible. This idea can probably be more readily seen if we say that the typical time between contacts is Tc = β\n−1, and the typical time until recovery is Tr = γ\n−1. From here it follows that, on average, the number of contacts by an infected individual with others ”before” the infected has recovered is: Tr/Tc.\nBy dividing the first differential equation by the third, Separation of variables—separating the variables and integrating we get\nS(t) = S(0)e−R0(R(t)−R(0))/N (7)\n, (where S(0) and R(0) are the initial numbers of, respectively, susceptible and removed subjects). Thus, in the limit t → +∞, the proportion of recovered individuals obeys the following transcendental equation\nR∞ = N − S(0)e−R0(R∞−R(0))/N (8)\n. This equation shows that at the end of an epidemic, unless S(0) = 0, not all individuals of the population have recovered, so some must remain susceptible. This means that the end of an epidemic is caused by the decline in the number of infected individuals rather than an absolute lack of susceptible subjects. The role of the basic reproduction number is extremely important. In fact, upon rewriting the equation for infectious individuals as follows:\ndI dt = (R0S/N − 1)γI (9)\n, it yields that if:\nR0 > N\nS(0) , (10)\nthen:\ndI dt (0) > 0, (11)\ni.e., there will be a proper epidemic outbreak with an increase of the number of the infectious (which can reach a considerable fraction of the population). On the contrary, if\nR0 < N\nS(0) , (12)\nthen\ndI dt (0) < 0, (13)\ni.e., independently from the initial size of the susceptible population the disease can never cause a proper epidemic outbreak. As a consequence, it is clear that the basic reproduction number is extremely important."
  }],
  "year": 2019,
  "references": [],
  "id": "SP:951dfa020c3c5c605670841e525ba6f468c284b6",
  "authors": [],
  "abstractText": ". Where S is the stock of susceptible population, I is the stock of infected, and R is the stock of recovered population. This model was for the first time proposed by O. Kermack and Anderson Gray McKendrick as a special case of what we now call Kermack-McKendrick theory, and followed work McKendrick had done with Ronald Ross. This system is non-linear, and does not admit a generic analytic solution. Nevertheless, significant results can be derived analytically, and with Monte Carlo methods, such as the Gillespie algorithm. Firstly note that from:"
}