{
  "sections": [{
    "heading": "THE ASCE STANDARDIZED REFERENCE",
    "text": ""
  }, {
    "heading": "EVAPOTRANSPIRATION EQUATION",
    "text": "Task Committee on Standardization of Reference Evapotranspiration\nEnvironmental and Water Resources Institute of\nthe American Society of Civil Engineers\nJanuary, 2005 Final Report"
  }, {
    "heading": "THE ASCE STANDARDIZED REFERENCE",
    "text": ""
  }, {
    "heading": "EVAPOTRANSPIRATION EQUATION",
    "text": ""
  }, {
    "heading": "PREPARED BY",
    "text": "Task Committee on Standardization of Reference\nEvapotranspiration of the"
  }, {
    "heading": "Environmental and Water Resources Institute",
    "text": ""
  }, {
    "heading": "TASK COMMITTEE MEMBERS",
    "text": "Ivan A. Walter (chair), Richard G. Allen (vice-chair), Ronald Elliott, Daniel Itenfisu, Paul Brown, Marvin E. Jensen, Brent Mecham, Terry A. Howell, Richard Snyder, Simon Eching, Thomas Spofford, Mary Hattendorf, Derrell Martin, Richard H. Cuenca, and James L. Wright"
  }, {
    "heading": "PRINCIPAL EDITORS",
    "text": "Richard G. Allen, Ivan A. Walter, Ronald Elliott, Terry Howell, Daniel Itenfisu,\nMarvin Jensen"
  }, {
    "heading": "ENDORSEMENTS",
    "text": ""
  }, {
    "heading": "Irrigation Association, 2004",
    "text": "ASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "ABSTRACT",
    "text": "This report describes the standardization of calculation of reference evapotranspiration (ET) as recommended by the Task Committee on Standardization of Reference Evapotranspiration of the Environmental and Water Resources Institute of the American Society of Civil Engineers. The purpose of the standardized reference ET equation and calculation procedures is to bring commonality to the calculation of reference ET and to provide a standardized basis for determining or transferring crop coefficients for agricultural and landscape use. The basis of the standardized reference ET equation is the ASCE Penman-Monteith (ASCE-PM) method of ASCE Manual 70. For the standardization, the ASCE-PM method is applied for two types of reference surfaces representing clipped grass (a short, smooth crop) and alfalfa (a taller, rougher agricultural crop), and the equation is simplified to a reduced form of the ASCE–PM. Standardized calculations for vapor pressure, net radiation and wind speed adjustment are recommended for application to hourly and daily calculation time steps. Guidelines on assessing weather data integrity and estimating values for missing data are provided.\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "THE ASCE STANDARDIZED REFERENCE",
    "text": ""
  }, {
    "heading": "EVAPOTRANSPIRATION EQUATION",
    "text": "Task Committee on Standardization of Reference Evapotranspiration"
  }, {
    "heading": "PREFACE",
    "text": "The concept of reference evapotranspiration (ET) was developed in the 1970’s as a practical and definable replacement for the term potential ET. Reference ET is a function of local weather, represents the ET from a defined vegetated surface, and serves as an evaporative index by which engineers, hydrologists, water managers and other technical professionals can predict ET for a range of vegetation and surface conditions by applying “crop” coefficients for agricultural or landscaped areas. During the past decade, for convenience and reproducibility, the reference surface has been expressed as a hypothetical surface having specific characteristics. In the context of this standardization, reference evapotranspiration is defined as the ET rate from a uniform surface of dense, actively growing vegetation having specified height and surface resistance, not short of soil water, and representing an expanse of at least 100 m of the same or similar vegetation. The EWRI Task Committee concluded that two standardized surfaces were needed to serve the needs of the agricultural and landscape communities and to provide for continuity with past reference ET usage. The ASCE Penman-Monteith (ASCE-PM) equation of ASCE Manual 70 is used to represent the standardized surface and is applied for two types of surfaces (short and tall)-- clipped, cool-season grass and alfalfa.\nThis recommended standardization follows commonly used procedures for calculating vapor pressure terms, net radiation, and soil heat flux. The standardization represents reference ET for each of the reference surfaces using a single equation having fixed constants and standardized computational procedures. The computational procedures are relatively simple to apply, are understandable, are\nASCE-EWRI Task Committee Report, January, 2005\nsupported by existing and historical data, are technically defensible, and are accepted by science and engineering communities. The Task Committee recognizes that the standardized reference equation, with fixed coefficients defining vegetation and surface conditions, may not correspond precisely with local measurements of ET from surfaces similar to the clipped, cool-season grass and full-cover alfalfa definitions. However, the Task Committee encourages the use of the standardized equation and procedure when possible to represent reference ET for the establishment of reproducible and universally transferable ET estimates, climatic description, and derived crop and landscape coefficients. The standardized equation has been investigated over a wide range of locations and climates across the United States and has the Task Committee’s confidence for use as a standardized index of evapotranspirative demand.\nSome of the computational procedures of the standardized reference method, for example, the computation of net radiation, may be updated by EWRI from time to time in the future, as developments and improvements in generalized computational techniques are made.\nThe development of this standardization report by EWRI was made at the request of, and has been endorsed by, the Irrigation Association.\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "THE ASCE STANDARDIZED REFERENCE EVAPOTRANSPIRATION",
    "text": "EQUATION\nTABLE OF CONTENTS\nINTRODUCTION 1"
  }, {
    "heading": "DEFINITION OF THE EQUATION 2",
    "text": "RECOMMENDATION 3"
  }, {
    "heading": "USE OF THE STANDARDIZED REFERENCE EVAPOTRANSPIRATION",
    "text": "EQUATION 6"
  }, {
    "heading": "CALCULATING STANDARDIZED REFERENCE CROP",
    "text": "EVAPOTRANSPIRATION 7\nREQUIRED DATA FOR THE STANDARDIZED REFERENCE EQUATION 7 CALCULATIONS REQUIRED FOR DAILY TIME-STEPS 9\nPsychrometric and Atmospheric Variables 9 Latent Heat of Vaporization (λ) 9 Mean Air Temperature (T) 9 Atmospheric Pressure (P) 10 Psychrometric Constant (γ) 10 Slope of the Saturation Vapor Pressure-Temperature Curve (∆) 10 Saturation Vapor Pressure (es) 11 Actual Vapor Pressure (ea ) 11 Net Radiation (Rn ) 17 Net Solar or Net Short-Wave Radiation (Rns ) 18 Net Long-Wave Radiation (Rnl ) 19 Clear-Sky Solar Radiation (Rso) 20 Extraterrestrial Radiation for 24-Hour Periods (Ra ) 23 Soil Heat Flux Density (G) 25\nASCE-EWRI Task Committee Report, January, 2005\nFor Daily Periods 25 For Monthly Periods 25 Wind Profile Relationship 26 CALCULATIONS REQUIRED FOR HOURLY TIME-STEPS 27\nPsychrometric and Atmospheric Variables 27 Latent Heat of Vaporization (λ) 27 Mean Air Temperature (T) 27 Atmospheric Pressure (P) 28 Psychrometric Constant (γ) 28 Slope of the Saturation Vapor Pressure-Temperature Curve (∆) 28 Saturation Vapor Pressure (es) 29 Actual Vapor Pressure (ea ) 29 Net Radiation (Rn ) 32 Net Solar or Net Short-Wave Radiation (Rns ) 33 Net Long-Wave Radiation (Rnl ) 33 Clear-sky solar radiation 37 Extraterrestrial radiation for hourly periods (Ra ) 39 Soil Heat Flux Density (G) 43 Wind Profile Relationship 44 Negative Values Computed for ETsz 45"
  }, {
    "heading": "DEFINITION AND APPLICATION OF CROP COEFFICIENTS 46",
    "text": "TRANSFER AND CONVERSION OF CROP COEFFICIENTS 46"
  }, {
    "heading": "CALCULATION OF REFERENCE EVAPOTRANSPIRATION DURING NON-",
    "text": ""
  }, {
    "heading": "GROWING PERIODS 48",
    "text": "REFERENCES 49"
  }, {
    "heading": "GLOSSARY OF TERMS 56",
    "text": "ASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "APPENDICES",
    "text": ""
  }, {
    "heading": "APPENDIX A - DESCRIPTION OF TASK COMMITTEE’S METHDOLOGY",
    "text": "AND PROCEDURES USED TO DERIVE THE STANDARDIZED REFERENCE EVAPOTRANSPIRATION EQUATION"
  }, {
    "heading": "APPENDIX B - SUMMARY OF REFERENCE EVAPOTRANSPIRATION",
    "text": "EQUATIONS USED IN EVALUATION"
  }, {
    "heading": "APPENDIX C - EXAMPLE CALCULATIONS FOR DAILY AND HOURLY",
    "text": "STANDARDIZED REFERENCE EVAPOTRANSPIRATION"
  }, {
    "heading": "APPENDIX D - WEATHER DATA INTEGRITY ASSESSMENT AND STATION",
    "text": "SITING"
  }, {
    "heading": "APPENDIX E - ESTIMATING MISSING CLIMATIC DATA",
    "text": ""
  }, {
    "heading": "APPENDIX F - SUMMARY OF REFERENCE EVAPOTRANSPIRATION",
    "text": ""
  }, {
    "heading": "COMPARISONS",
    "text": "ASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "LIST OF FIGURES",
    "text": "Figure 1. Daily Rs at Parma, Idaho during 1998 (elevation 703 m, Lat. 43.8o) and Rso envelope from Eq. 19.................................................. 21 Figure 2. Measured and calculated hourly Rso for two days at Parma,\nIdaho during 1998 using Eq. 48 and using the more accurate KB + KD method of Appendix D. ....................................................... 38\nFigure A-1. Frequency of ratio of daily ETo or ETos to daily ETo by ASCE-PM equation for 56 site-years covering 33 locations. ......... A-19\nFigure A-2. Frequency of ratio of daily ETr or ETrs to daily ETr by ASCEPM equation for 56 site-years covering 33 locations...................... A-20\nFigure A-3. Average ratio of daily ETo or ETos to daily ETo by ASCE-PM ETo equation. .................................................................................. A-26\nFigure A-4. Average ratio of daily ETr or ETrs to daily ETr by ASCE-PM equation........................................................................................... A-27\nFigure A-5. Mean daily ETo for the growing season computed using various ETo methods and ETos vs. mean daily ETo for the growing season using the full ASCE-PM equation, for daily time steps. Each data point represents one-site year of data (82 total site-years (see Table A-3 and App. F))............................. A-28\nFigure A-6. Mean daily ETr for the growing season computed using the 1982 Kimberly Penman method and ETrs vs. mean daily ETr for the growing season using the full ASCE-PM equation, for daily time steps. Each data point represents one-site year of data (82 total site-years (see Table A-3 and App. F)). ................... A-29\nFigure A-7. Average ratio of summed hourly ETo or ETos to daily ETo by ASCE-PM ETo equation. ................................................................ A-30\nFigure A-8. Average ratio of summed hourly ETr or ETrs to daily ETr by ASCE-PM ETr equation.................................................................. A-31\nFigure D-1. Daily Measured Rs and Calculated Rso using Eq. 19 of the text and using Eq. D.1 – D.5 for Calipatria (top) and Seeley (bottom), California CIMIS stations in the Imperial Valley during 1999 ..................................................................................... D-11\nFigure D-2. Daily Measured Rs and Calculated Rso using Eq. 19 of the text and using Eq. D.1 – D.5 for Greeley, Colorado during 2000................................................................................................. D-13\nFigure D-3. Hourly measured solar radiation and clear-sky envelopes for two days in August, 2000 near Greeley, Colorado. ........................ D-14\nFigure D-4. Measured and calculated hourly net radiation for one day at Kimberly, Idaho over clipped grass (Rn was calculated using Eq. 42-44). Data courtesy of Dr. J.L. Wright, USDA-ARS, Kimberly. ........................................................................................ D-15\nFigure D-5. Measured daily minimum air temperature and mean daily dewpoint temperature (top) and daily maximum and minimum relative humidity (bottom) recorded for Rocky Ford, Colorado during 1999. .................................................................................... D-19\nASCE-EWRI Task Committee Report, January, 2005\nFigure D-6. Measured daily minimum air temperature and mean daily dewpoint temperature for Rocky Ford, Colorado during 1999, where Tdew for days 15 to 200 was replaced by estimates using Eq. D-8. ................................................................................. D-20\nFigure D-7. Hourly air temperature and measured dewpoint temperature from dual sensor systems near Kimberly, Idaho, July 17, 1990. Data courtesy of Dr. J.L. Wright, USDA-ARS, Kimberly, Idaho. ............................................................................. D-22\nFigure D-8. ETos by month for the summer of 2000 at Parker, AZ computed using meteorological data collected under reference (alfalfa) and non-reference (fallow) conditions. ............................. D-25\nFigure D-9. a) Daily minimum air temperature and daily mean dew point temperature vs. day of the year and b) daily maximum and daily minimum relative humidity vs. day of the year for Greeley, Colorado, during 2000...................................................... D-26\nFigure D-10. Hourly dewpoint from four irrigated regions of southeast Idaho and from a desert weather station (Flint Creek) on July 6, 2000. Also shown are air temperatures at Aberdeen and Flint Creek....................................................................................... D-28\nFigure D-11. a) Plot showing the increase in the gust factor at Eloy, AZ during a period when an anemometer was failing due to bearing contamination.\nb) Ratio of daily mean wind speeds at Eloy, AZ to those at Maricopa, AZ during the period of anemometer failure described in a). ................................................................................ D-33\nFigure D-12 Daily mean wind speeds recorded at three neighboring AWS stations in SE Colorado during 1995 (a) and ratios of wind speeds to those at Rocky Ford for the same stations (b). ................ D-35\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "LIST OF TABLES",
    "text": "Table 1. Values for Cn and Cd in Eq. 1............................................................... 5 Table 2. ASCE Penman-Monteith Terms Standardized for\nApplication of the Standardized Reference Evapotranspiration Equation ................................................................ 5\nTable 3. Preferred method for calculating ea for daily ETsz ............................. 12 Table 4. Preferred method for calculating ea for ETsz for hourly\nperiods................................................................................................. 30\nTable A-1. Reference Evapotranspiration Equations and Procedures Evaluated1 ....................................................................................... A-14\nTable A-2. Statistical summary of the comparisons between the Standardized Reference Evapotranspiration Equations and ASCE Penman-Monteith for the growing season for 82 site-years at 49 locations. ................................................................ A-23\nTable A-3. Summary of weather station sites in the study (listed from east to west longitude)..................................................................... A-25\nTable B-1. Parameter equation numbers, etc. used in the Reference Equations Evaluated.......................................................................... B-2\nTable C-1. Characteristics of the Greeley, Colorado weather station................. C-2\nTable C-2. Calculation constants for the Greeley, Colorado weather station ................................................................................................ C-2\nTable C-3. Measured data, calculations, and ETos and ETrs for daily time steps for July 1-10, 2000 near Greeley, Colorado. ................... C-5\nTable C-4. Measured data, calculations, and ETos and ETrs for hourly time steps for July 1-2, 2000 near Greeley, Colorado. ................... C-10 Table E-1. General classes of wind speed data (taken from FAO-56) ................E-8 Table F-1. Summary of weather station sites used in the study (listed\nfrom east to west longitude)...............................................................F-2 Table F-2. Statistical summary of the comparisons between various\nreference ET methods, using growing-season results from 82 site-years of daily and 76 site-years of hourly data. .....................F-3\nTable F-3 Ratio of method Daily ETo to Daily ASCE-PM ETo ........................F-4 Table F-4. Ratio of Hourly Sum ETo to Daily ETo (within Method)..................F-6 Table F-5. Ratio of Hourly Sum ETo to Daily ASCE-PM ETo...........................F-8 Table F-6. Ratio of method Hourly Sum ETo to Hourly Sum ASCE PMD ETo F-10 Table F-7. Ratio of Daily ETr to Daily ASCE PM ETr.....................................F-12 Table F-8. Ratio of Hourly Sum ETr to Daily ETr (within method) .................F-15 Table F-9. Ratio of Hourly Sum ETr to Daily ASCE-PM ETr..........................F-18 Table F-10. Ratio of Hourly Sum ETr to Hourly Sum ASCE PMD ETr ..................................................................................................................................F-21\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "THE ASCE STANDARDIZED REFERENCE EVAPOTRANSPIRATION",
    "text": ""
  }, {
    "heading": "EQUATION",
    "text": "Task Committee on Standardization of Reference Evapotranspiration1 of the Environmental and Water Resources Institute of the American Society of Civil\nEngineers"
  }, {
    "heading": "INTRODUCTION",
    "text": "In May 1999, The Irrigation Association (IA) requested the Evapotranspiration in Irrigation and Hydrology Committee – Environmental and Water Resources Institute (American Society of Civil Engineers) (ASCE-ET) to establish and define a benchmark reference evapotranspiration equation. The purpose of the benchmark equation is to standardize the calculation of reference evapotranspiration and to improve transferability of crop coefficients.\nIA envisioned an equation that would be accepted by the U.S. scientific community, engineers, courts, policy makers, and end users. The equation would be applicable to agricultural and landscape irrigation and would facilitate the use and transfer of crop and landscape coefficients. In addition, IA requested guidelines for using the equation in regions where climatic data are limited and recommendations for\n1I. A. Walter2,a, R. G. Allen2,3,b, R. Elliott2, D. Itenfisu2, P. Brown2, M. E. Jensen2, B. Mecham3, T. A. Howell2,3, R. Snyder2, S. Eching2, T. Spofford2,3, M. Hattendorf2, D. Martin2, R. H. Cuenca2, and J. L. Wright2 2 Member, EWRI TC 3Member, Irrigation Association Water Management Committee (IA-WM) aChair of the EWRI TC; bVice-chair of the EWRI TC\nASCE-EWRI Task Committee Report, January, 2005\nincorporating existing crop and landscape coefficients and existing reference ET calculations.\nAn ASCE-ET Task Committee (TC) comprised of the authors of this report responded to the request by IA. Their initial response is included in Appendix A. Members of the TC jointly authored several papers (Allen, et al., 2000; Itenfisu, et al., 2000; Walter, et al., 2000) at the IA 4th National Irrigation Symposium in November 2000 that described issues, challenges and analyses conducted by the TC. This report provides detail on development of the ASCE Standardized equation, recommendations on use of the equation, and example calculations. In addition, this report provides guidelines for assessing the integrity of weather data used for estimating ET and methodologies that can be used where data are limited or missing."
  }, {
    "heading": "DEFINITION OF THE EQUATION",
    "text": "Evapotranspiration (ET) represents the loss of water from the earth’s surface through the combined processes of evaporation (from soil and plant surfaces) and plant transpiration (i.e., internal evaporation). Reference evapotranspiration (ETref) is the rate at which readily available soil water is vaporized from specified vegetated surfaces (Jensen et al., 1990). For convenience and reproducibility, the reference surface has recently been expressed as a hypothetical crop (vegetative) surface with specific characteristics (Smith et al., 1991, Allen et al., 1994a, Allen et al., 1998). In the context of this standardization report, reference evapotranspiration is defined as the ET rate from a uniform surface of dense, actively growing vegetation having specified height and surface resistance, not short of soil water, and representing an expanse of at least 100 m of the same or similar vegetation.\nASCE-ET recommends that the equation be referred to as the “Standardized Reference Evapotranspiration Equation” (ETsz). ASCE-ET is of the opinion that use of the terms standard or benchmark may lead users to assume that the equation is\nASCE-EWRI Task Committee Report, January, 2005\nintended for comparative purposes (i.e., a level to be measured against). Rather, the use of the term “standardized” is intended to infer that the computation procedures have been fixed, and not that the equation is a standard or a benchmark or that the equation has undergone the degree of review in the approval process necessary for standards adopted by ASCE, ASAE, American National Standards Institute, or the International Organization for Standardization.\nASCE-ET and IA-WM members concluded that two ETref surfaces with standardized computational procedures were needed. The two adopted ETref surfaces are (1) a short crop (similar to clipped grass) and (2) a tall crop (similar to full-cover alfalfa). Additionally, the TC recognized that an equation capable of calculating both hourly and daily ETref was needed."
  }, {
    "heading": "RECOMMENDATION",
    "text": "ETref from each of the two surfaces is modeled using a single Standardized Reference Evapotranspiration equation with appropriate constants and standardized computational procedures. The surfaces/equation are defined as:\nStandardized Reference Evapotranspiration Equation, Short (ETos): Reference ET for a short crop with an approximate height of 0.12 m (similar to clipped, cool-season grass).\nStandardized Reference Evapotranspiration Equation, Tall (ETrs): Reference ET for a tall crop with an approximate height of 0.50 m (similar to full-cover alfalfa).\nThe two surfaces are similar to known full-cover crops of alfalfa and clipped, coolseason grass that have received widespread use as ETref across the United States. Each reference has unique advantages for specific applications and times of the year. As a part of the standardization, the ASCE Penman-Monteith (ASCE-PM) equation\nASCE-EWRI Task Committee Report, January, 2005\n(Appendix B and Jensen et al., 1990), and associated equations for calculating aerodynamic and bulk surface resistance have been combined and condensed into a single equation that is applicable to both surfaces.\nThe Standardized Reference Evapotranspiration Equation is intended to simplify and clarify the presentation and application of the method. As used in this report, the term ETsz refers to both ETos and ETrs. Eq. 1 presents the form of the Standardized Reference Evapotranspiration Equation:\n)(\n)()(.\n2d\nas2 n n\nsz uC1\neeu 273T\nC GR4080\nET ++∆\n− + +−∆ =\nγ\nγ (1)\nwhere:\nETsz = standardized reference crop evapotranspiration for short (ETos) or tall (ETrs) surfaces (mm d-1 for daily time steps or mm h-1 for hourly time steps), Rn = calculated net radiation at the crop surface (MJ m-2 d-1for daily time steps or MJ m-2 h-1 for hourly time steps), G = soil heat flux density at the soil surface (MJ m-2 d-1 for daily time steps or MJ m-2 h-1 for hourly time steps), T = mean daily or hourly air temperature at 1.5 to 2.5-m height (°C), u2 = mean daily or hourly wind speed at 2-m height (m s-1), es = saturation vapor pressure at 1.5 to 2.5-m height (kPa), calculated for\ndaily time steps as the average of saturation vapor pressure at maximum and minimum air temperature,\nea = mean actual vapor pressure at 1.5 to 2.5-m height (kPa), ∆ = slope of the saturation vapor pressure-temperature curve (kPa °C-1), γ = psychrometric constant (kPa °C-1), Cn = numerator constant that changes with reference type and calculation time step (K mm s3 Mg-1 d-1 or K mm s3 Mg-1 h-1) and Cd = denominator constant that changes with reference type and calculation time step (s m-1). Units for the 0.408 coefficient are m2 mm MJ-1.\nASCE-EWRI Task Committee Report, January, 2005\nTable 1 provides values for Cn and Cd. The values for Cn consider the time step and aerodynamic roughness of the surface (i.e., reference type). The constant in the denominator, Cd, considers the time step, bulk surface resistance, and aerodynamic roughness of the surface (the latter two terms vary with reference type, time step and daytime/nighttime). Cn and Cd were derived by simplifying several terms within the ASCE-PM equation and rounding the result. Equations associated with calculation of required parameters in Eq. 1, the detailed derivation of the parameters in Table 1 and simplification of the terms listed in Table 2 are explained in more detail in Appendix B. Daytime is defined as occurring when the average net radiation, Rn, during an hourly period is positive.\ngrass. See comments in Appendix B following Eq. B.14b. When wind speed is measured over a surface having vegetation taller than about 0.3 m, it is recommended that the “full” ASCE Penman-Monteith method (Eq. B.1) be employed, where the zero plane displacement can be varied. However, the standardized ETsz equation can be used if wind speed are adjusted following guidelines in Appendix B."
  }, {
    "heading": "USE OF THE STANDARDIZED REFERENCE EVAPOTRANSPIRATION",
    "text": ""
  }, {
    "heading": "EQUATION",
    "text": "Based on an intensive review of reference evapotranspiration calculated for 49 sites throughout the United States (as described in the following section), ASCE-ET found the standardized reference evapotranspiration equation to be reliable and recommends its use for:\n• Calculating reference evapotranspiration and, in turn, crop evapotranspiration\n(ETc)\n• Developing new crop coefficients\n• Facilitating transfer of existing crop coefficients\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "CALCULATING STANDARDIZED REFERENCE CROP",
    "text": ""
  }, {
    "heading": "EVAPOTRANSPIRATION",
    "text": "This section describes data requirements, equations, and procedures necessary for calculating ETsz on a daily and hourly time step. A daily time step has historically been commonly used in the calculation of ETref. Selection of the appropriate time step is a function of data availability, climate, the intended application, and user preference."
  }, {
    "heading": "REQUIRED DATA FOR THE STANDARDIZED REFERENCE EQUATION",
    "text": "The calculation of ETsz requires measurements or estimates for air temperature, humidity, solar radiation, and wind speed. These parameters are considered to be the minimum requirements to estimate ETos and ETrs. Examples of the calculation of ETsz are provided in Appendix C. When humidity, solar radiation or wind speed measurements are not available, substitute values for daily and longer time periods may be estimated using procedures described in Appendix E.\nThe accuracy of any evapotranspiration calculation depends on the quality of the weather data, which requires good quality control and quality assurance procedures. When possible, weather data should be measured at stations that are located in open, well-watered, vegetated settings (preferably grass). Preferred locations have low growing, well-watered vegetation in the immediate and near vicinity of the weather station (~50 m) and mostly the same or other well-watered vegetation for a few hundred meters beyond that2. Suggestions for assessing and improving the integrity of collected weather data are described in Appendix D. Appendix D also provides\n2 This recommendation is similar to those found in ASAE Engineering Practice EP505 (ASAE 2004).\nASCE-EWRI Task Committee Report, January, 2005\nguidelines for evaluating the weather station site and the possible impact upon the measured meteorological parameters. Suggestions for replacing missing data or data that are of poor quality are presented in Appendix E.\nAppendix B provides background on the development of the standardized form of the ASCE equation. The full form of the ASCE-PM equation, which includes explicit terms for aerodynamic and surface resistance, is not required, nor is it recommended, for calculation of ETsz. The full form of the ASCE-PM equation is recommended when ET is measured over grass or alfalfa vegetation having substantially different height than the 0.12 m height defined for the short reference (grass) or 0.50 m height defined for the tall reference (alfalfa). Values for vegetation height are fixed in the standardized equation.\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "CALCULATIONS REQUIRED FOR DAILY TIME-STEPS",
    "text": "The calculation process for ETsz for daily time steps is presented in this section. Several of the calculations are identical to those required for hourly time steps. Some equations are repeated in the hourly calculation section so as to detail that calculation process completely.\nPsychrometric and Atmospheric Variables3"
  }, {
    "heading": "Latent Heat of Vaporization (λ)",
    "text": "The value of the latent heat of vaporization, λ, varies only slightly over the ranges of air temperature that occur in agricultural or hydrologic systems. For ETsz, a constant value of λ = 2.45 MJ kg-1 is recommended. The inverse of λ = 2.45 MJ kg-1 is approximately 0.408 kg MJ-1. The density of water (ρw) is taken as 1.0 Mg m-3 so that the inverse ratio of λ ρw times energy flux in MJ m-2 d-1 equals 1.0 mm d-1."
  }, {
    "heading": "Mean Air Temperature (T)",
    "text": "For the standardized method, the mean air temperature, T, for a daily time step is preferred as the mean of the daily maximum and daily minimum air temperatures rather than as the average of hourly temperature measurements to provide for consistency across all data sets.\n2 TT T minmax + = (2)\nwhere:\nT = daily mean air temperature [°C] Tmax = daily maximum air temperature [°C] Tmin = daily minimum air temperature [°C]\n3 Many of the equations presented here are the same as those reported in ASCE Manual 70 (Jensen et al., 1990) and in FAO-56 (Allen et al., 1998).\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section"
  }, {
    "heading": "Atmospheric Pressure (P)",
    "text": "The mean atmospheric pressure at the weather site is predicted from site elevation using a simplified formulation of the Universal Gas Law4:\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ 293 z0.0065-293 5.26 101.3 = P (3)\nwhere:\nP = mean atmospheric pressure at station elevation z [kPa], and z = weather site elevation above mean sea level [m]."
  }, {
    "heading": "Psychrometric Constant (γ)",
    "text": "The standardized application using λ = 2.45 MJ kg-1 results in a value for the\npsychrometric constant, γ, that is proportional to the mean atmospheric pressure:\nP0006650. = γ (4)\nwhere P has units of kPa and γ has units of kPa °C-1.\nNote: The variable γ is not the same variable as γpsy used later in Eqs. 9 and 10 for converting psychrometric data (wet bulb and dry bulb temperature) to vapor pressure."
  }, {
    "heading": "Slope of the Saturation Vapor Pressure-Temperature Curve (∆)",
    "text": "The slope of the saturation vapor pressure-temperature curve5, ∆, is computed as:\n( )2237.3+T\n3237.+T\nT17.27 exp 3250\n= ⎟⎟ ⎠\n⎞ ⎜⎜ ⎝ ⎛\n∆ (5)\n4 Reference: Burman et al. (1987) 5 References: Tetens (1930), Murray (1967)\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nwhere:\n∆ = slope of the saturation vapor pressure-temperature curve [kPa °C-1], and T = daily mean air temperature [°C].\nSaturation Vapor Pressure (es) The saturation vapor pressure6 (es) represents the capacity of the air to hold water vapor.\nFor calculation of daily ETsz , es is given by:\n( ) ( ) 2 TeTe e min o max o s + = (6)\nwhere:\neo(T) = saturation vapor pressure function (Eq. 7) [kPa]\nThe function to calculate saturation vapor pressure is:\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ 237.3T+ T 17.27exp 080.61 = (T)eo (7)\nwhere vapor pressure is in units of kPa and temperature is in °C.\nActual Vapor Pressure (ea ) Actual vapor pressure (ea) is used to represent the water content (humidity) of the air at the weather site. The actual vapor pressure can be measured or it can be calculated from various humidity data, such as measured dew point temperature, wet-bulb and dry-bulb temperature, or relative humidity and air temperature data.\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nPreferred procedures for calculating ea When multiple types of humidity or psychrometric data are available for estimating ea, the preferences listed in Table 3 are recommended for the calculation method. These recommendations are based on the likelihood that the data will have integrity and that estimates for ea will be representative. The availability and quality of local data, as well as site conditions, may justify a different order of preference.\n6 Reference: Jensen et al. (1990) and Tetens (1930)\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nWhen humidity and psychrometric data are missing or are of questionable integrity, dew point temperature can be estimated from daily minimum air temperature as described in Appendix E. This estimation process should be verified locally. The assessment of weather data integrity is discussed in Appendix D.\nea from measured dew point temperature The dew point temperature (Tdew) is the temperature to which the air must cool to reach a state of saturation. For daily calculation time steps, average dew point temperature can be computed by averaging over hourly periods or, for purposes of estimating ETsz, it can be determined by an early morning measurement (generally at 0700 or 0800 hours). The value for ea is calculated by substituting Tdew into Eq. 7 resulting in:\n( ) ⎥ ⎦ ⎤ ⎢ ⎣ ⎡ + == 3.237T T27.17 exp6108.0Tee dew dew dew o a (8)\nea from psychrometric data\nThe actual vapor pressure can also be determined from the difference between the dry and wet bulb temperatures (i.e., the wet bulb depression) of the air:\n( ) ( )wetdrypsywetoa TTTee −−= γ (9) where:\nea = actual vapor pressure of the air [kPa], e°(Twet) = saturation vapor pressure at the wet bulb temperature [kPa] (Eq. 7), γpsy = psychrometric constant for the psychrometer [kPa °C-1], and Tdry - Twet = wet bulb depression, where Tdry = dry bulb temperature and Twet = the wet bulb temperature [°C] (measured simultaneously).\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nThe psychrometric constant for the psychrometer at the weather measurement site is given by:\nPa psypsy =γ (10) where\napsy = coefficient depending on the type of ventilation of the wet bulb [°C-1], and P = mean atmospheric pressure [kPa].\nThe coefficient apsy depends primarily on the design of the psychrometer and on the rate of ventilation around the wet bulb. The following values are often used7:\napsy = 0.000662 for ventilated (Asmann type) psychrometers having air\nmovement between 2 and 10 m s-1 for Twet ≥ 0 and 0.000594 for Twet < 0, = 0.000800 for naturally ventilated psychrometers having air movement of about 1 m s-1, and = 0.001200 for non-ventilated psychrometers installed in glass or plastic greenhouses.\nGenerally, the wet-bulb and dry-bulb temperature data are measured once during the day.\nea from relative humidity data\nThe actual vapor pressure of air can be calculated from relative humidity (RH) and the corresponding air temperature. When using RH data, it is essential that the RH and air temperature data are “paired,” i.e., that they represent the same time of day or time period and that they are taken at the weather measurement site. For daily data, daily maximum relative humidity (RHmax) can be paired with Tmin, which will both\n7 Allen et al., (1998).\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\noccur, generally, during early morning. Daily minimum relative humidity (RHmin) is paired with Tmax.\nDepending on the availability of the RH data, the following equations apply, with preference of method listed in Table 3:\n• Daily ea from RHmax and RHmin.\n( ) ( )\n2 100\nRH Te 100 RH\nTe e\nmin max omax min o\na\n+ = (11)\nwhere:\nea = actual vapor pressure [kPa], e°(Tmin) = saturation vapor pressure at daily minimum temperature [kPa], e°(Tmax) = saturation vapor pressure at daily maximum temperature [kPa], RHmax = daily maximum relative humidity [%], and RHmin = daily minimum relative humidity [%].\nWhen computing the average daily ETsz during a week, a ten-day period or a month, RHmax and RHmin are obtained by averaging daily RHmax or RHmin values.\n• Daily ea from RHmax\nOlder styles of electronic relative humidity sensors, for example those manufactured before about 1990, often experienced difficulty in accurately measuring RH when at low levels. When using equipment where errors in estimating RHmin may be large, or when integrity of the RH data is doubtful, the actual vapor pressure can be computed from RHmax:\n( ) 100\nRH Tee maxmin o a = (12)\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nWhen accuracy of RH data is in doubt, error in RHmax causes smaller error in ea than error in RHmin, due to the smaller value for the multiplier eo(Tmin) as compared to eo(Tmax). In addition, RHmax data are generally easier to assess for accuracy than is RHmin. The value of RHmax generally exceeds 90% and approaches 100% in wellwatered settings such as within irrigation projects and in sub-humid and humid climates. This proximity to 100% serves as a first check on reasonableness, representativeness, and integrity of the data. Exceptions to this trend are where substantial advection of dry or warm air from dry regions outside the area occurs during nighttime, including, but not limited to,some desert areas of New Mexico, Arizona and California.\n• Daily ea from RHmin\nSometimes, only high quality estimates of daily RHmin are available and must be used to predict ea:\n( ) 100\nRH Tee minmax o a = (13)\nHowever, estimates using Eq. 13 may be less desirable than estimates using Eq. 11 or 12, due to greater impact of error in RHmin on ea, as discussed previously. In addition, it is more difficult to assess the integrity of RHmin data (see Appendix D):\n• Daily ea from RHmean\nIn the absence of RHmax and RHmin data, but where daily RHmean data are available, the actual vapor pressure may be estimated as:\n( eanmomeana Te100 RHe = ) (14)\nwhere RHmean is the mean daily relative humidity, generally defined as the average between RHmax and RHmin and Tmean is mean daily air temperature, defined in Eq. 2\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nEq. 14 is less desirable than Eqs. 12 or 13 because the eo(T) relationship is nonlinear. Eq. 14 produces estimates of ea that are closer to those by Eq. 11 and to daily average ea computed from hourly values than is the use of alternative forms of Eq. 14, such as ea = RHmean/100 [eo(Tmax)+eo(Tmin)]/2 described in Allen et al., (1998) or as ea = RHmean/100 [1/(50/eo(Tmax) + 50/eo(Tmin))] described in Smith et al., (1991). These latter two methods are not recommended in the standardized procedure."
  }, {
    "heading": "Net Radiation (Rn )",
    "text": "Net radiation (Rn) is the net amount of radiant energy available at a vegetation or soil surface for evaporating water, heating the air, or heating the surface. Rn includes both short and long wave radiation components8:\nnlnsn RRR −= (15)\nwhere:\nRns = net short-wave radiation, [MJ m-2 d-1] (defined as being positive downwards and negative upwards), Rnl = net outgoing long-wave radiation, [MJ m-2 d-1] (defined as being positive upwards and negative downwards),\nRns and Rnl are generally positive or zero in value.\nNet radiation is difficult to measure because net radiometers are problematic to maintain and calibrate. There is good likelihood of systematic biases in Rn measurements. Therefore, Rn is often predicted from observed short wave (solar) radiation, vapor pressure, and air temperature. This prediction is routine and generally highly accurate. If Rn is measured, then care and attention must be given to the calibration of the radiometer, the surface over which it is located, maintenance of\n8 Reference: Brutsaert (1982), Jensen et al., (1990), Wright (1982), Doorenbos and Pruitt (1975,1977), Allen et al., (1998).\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nthe sensor domes, and level of the instrument. The condition of the vegetation surface is as important as the sensor. For purposes of calculating ETsz, the measurement surface for Rn is generally assumed to be clipped grass or alfalfa at full cover."
  }, {
    "heading": "Net Solar or Net Short-Wave Radiation (Rns )",
    "text": "Net short-wave radiation resulting from the balance between incoming and reflected solar radiation is given by:\nsssns R1RRR )( αα −=−= (16) where:\nRns = net solar or short-wave radiation [MJ m-2 d-1], α = albedo or canopy reflection coefficient, is fixed at 0.23 for the standardized short and tall reference surfaces [dimensionless], and Rs = incoming solar radiation [MJ m-2 d-1].\nThe calculation of ETsz uses the constant value of 0.23 for albedo for daily and hourly periods. It is recognized that albedo varies somewhat with time of day and with time of season and latitude due to change in sun angle. However, because the solar intensity is less during these periods, the error introduced in fixing albedo at 0.23 is relatively small (Allen et al., 1994b). Users may elect to use a different prediction for albedo, however, it is essential to ascertain the validity and accuracy of an alternative method using good measurements of incoming and reflected solar radiation. Some types of pyranometers are invalid for measuring reflected radiation due to the difference in spectral response between the instrument and reflecting surface. Predictions of Rn made using an alternate method for albedo (i.e., other than 0.23) may not agree with those made using the ASCE standardized procedure.\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section"
  }, {
    "heading": "Net Long-Wave Radiation (Rnl )",
    "text": "There are several variations and coefficients developed for predicting the net long wave component of total net radiation. The standardized ASCE procedure is the same as that adopted by FAO-56 and is based on the Brunt (1932, 1952) approach for predicting net emissivity. If users intend to utilize a different approach for calculating Rnl, it is essential to ascertain the validity and accuracy of their Rn method using net radiometers in excellent condition and that are calibrated to some dependable and recognized standard. In all situations, users should compare measured Rn or Rn computed using an alternative method with Rn calculated using the standardized procedure. Substantial variation (more than 5 %) should give cause for concern and should indicate the need to reconcile or justify the differences.\nRnl, net long-wave radiation, is the difference between upward long-wave radiation from the standardized surface (Rlu) and downward long-wave radiation from the sky (Rld), so that Rnl = Rlu – Rld. The following calculation for daily Rnl follows the method of Brunt (1932, 1952) of using vapor pressure to predict net emissivity:\n( ) ⎥ ⎥\n⎦\n⎤\n⎢ ⎢ ⎣\n⎡ + −σ=\n2\nTT e14.034.0fR\n4 minK 4 maxK\nacdnl (17)\nwhere:\nRnl = net long-wave radiation [MJ m-2 d-1], σ = Stefan-Boltzmann constant [4.901 x 10-9 MJ K-4 m-2 d-1], fcd = cloudiness function [dimensionless] (limited to 0.05 ≤ fcd ≤ 1.0), ea = actual vapor pressure [kPa], TK max = maximum absolute temperature during the 24-hour period [K] (K = °C + 273.16), TK min = minimum absolute temperature during the 24-hour period [K] (K =\n°C + 273.16).\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nThe superscripts “4” in Eq. 17 indicate the need to raise the air temperature, expressed in Kelvin units, to the power of 4. For daily and monthly calculation timesteps, fcd is calculated as9:\n35.0 R R 35.1f so s cd −= (18)\nwhere:\nRs/Rso = relative solar radiation (limited to 0.3 ≤ Rs/Rso ≤ 1.0), Rs = measured or calculated solar radiation [MJ m-2 d-1], and Rso = calculated clear-sky radiation [MJ m-2 d-1].\nThe ratio Rs/Rso in Eq. 18 represents relative cloudiness and is limited to 0.3 < Rs/Rso ≤1.0 so that fcd has limits of 0.05 ≤ fcd ≤ 1.0."
  }, {
    "heading": "Clear-Sky Solar Radiation (Rso)",
    "text": "Clear-sky solar radiation (Rso) is used in the calculation of net radiation (Rn). Clearsky solar radiation is defined as the amount of solar radiation (Rs) that would be received at the weather measurement site under conditions of clear-sky (i.e., cloudfree). The ratio of Rs to Rso in the equation for Rn is used to characterize the impact of cloud-cover on the downward emission of thermal radiation to the earth’s surface. Daily Rso is a function of the time of year and latitude. Rso is also impacted by station elevation (affecting atmospheric thickness and transmissivity), the amount of precipitable water in the atmosphere (affecting the absorption of some short-wave radiation), and the amount of dust or aerosols in the air.\nExtraterrestrial radiation (Ra), as defined in Eq. 21, can be used as a means for determining a theoretical Rsoenvelope as illustrated in Figure 1. The envelope can be expressed in tabular form or as an equation. In this section, a simple procedure10 is\n9 Jensen et al., (1990); Allen et al., (1998) ASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section 10 Reference: Allen (1996)\ndemonstrated for estimating Rso for purposes of predicting net radiation. A more involved procedure, useful for evaluating Rs data integrity, is described in Appendix D. The clear sky envelope can alternatively be developed using measured Rs from a period of one year or longer. The measured data should be confirmed for accuracy, including sensor calibration and maintenance (levelness and cleanliness). When measured Rs data are used to define an Rso envelope for a location, the resulting envelope should be compared with a theoretically derived envelope to confirm that there are no substantial differences in shape or magnitude. In general, the theoretically derived curve (Figure 1) is recommended.\nParma, Idaho, 1998\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nWhen a dependable, locally calibrated procedure for determining Rso is not available, Rso, for purposes of calculating Rn, can be computed as:\n( ) a5so Rz10x2750R −+= . (19) where:\nz = station elevation above sea level [m].\nEq. 19 predicts progressively higher levels of clear sky radiation with increasing elevation, and is the basis for the “0.76” factor for the Rso curve drawn in Figure 1. Elevation serves as a surrogate for total air mass and atmospheric transmissivity above the measurement site.\nWhen dependable, locally calibrated values are available for applying the “Angstrom” formula (see Eq. A.44), the clear sky radiation can be computed as:\naabso RKR = (20) where:\nRso = clear-sky solar radiation [MJ m-2 d-1], Ra = extraterrestrial radiation [MJ m-2 d-1], Kab = coefficient that can be derived from the as and bs coefficients of the\nAngstrom formula, where Kab = as + bs, and where Kab represents the fraction of extraterrestrial radiation reaching the earth on clearsky days,\nas = constant expressing the fraction of extraterrestrial radiation reaching the earth’s surface on completely overcast days (see Eq. E.2 in Appendix E), and bs = constant expressing the additional fraction of extraterrestrial radiation reaching the earth’s surface on a clear day (see Eq. E.2 in Appendix E).\nEqs. 19 or 20 are generally adequate for use in estimating Rso in Eq. 18 when predicting net radiation, Rn. More complex estimates for Rso, which include impacts of turbidity and water vapor on radiation absorption, can be used for assessing ASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\nintegrity of solar radiation data and are discussed in Appendix D. The difference in ETrs or ETos resulting from the use of Eq. 19 or 20, as opposed to the more complicated and accurate Rso equations D.1 – D.5 of Appendix D, will be generally less than a few percent over an annual period.\nExtraterrestrial Radiation for 24-Hour Periods (Ra )11\nExtraterrestrial radiation, Ra, defined as the short-wave solar radiation in the absence of an atmosphere, is a well-behaved function of the day of the year, time of day, and latitude. It is needed for calculating Rso, which is in turn used in calculating Rn. For daily (24-hour) periods, Ra can be estimated from the solar constant, the solar declination, and the day of the year:\n[ ])sin()cos()cos()sin()sin( ssrsca dG 24R ωδϕδϕω π += (21)\nwhere:\nRa = extraterrestrial radiation [MJ m-2 d-1], Gsc = solar constant [4.92 MJ m-2 h-1], dr = inverse relative distance factor (squared) for the earth-sun [unitless], ωs = sunset hour angle [radians], ϕ = latitude [radians], and δ = solar declination [radians].\nThe latitude, ϕ, is positive for the Northern Hemisphere and negative for the Southern Hemisphere. The conversion from decimal degrees to radians is given by:\n( reesdegdecimal 180 Radians )π= (22) and dr and δ are calculated as:\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ π+= J 365 2cos033.01dr (23)\n11 Reference: Duffie and Beckman (1980).\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ − π =δ 39.1J 365 2sin409.0 (24)\nwhere: J is the number of the day in the year between 1 (1 January) and 365 or 366 (31 December). The constant 365 in Eqs. 23 and 24 is held at 365 even during a leap year. J can be calculated as12:\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ ⎟ ⎠ ⎞ ⎜ ⎝ ⎛ ⎟ ⎠ ⎞ ⎜ ⎝ ⎛ 0.975 + 4 4) Y, Mod( - 100 M Int + 1 + M 3Int 2 + 9 M 275 Int + 32 - D = J M (25)\nwhere:\nDM = the day of the month (1-31), M = the number of the month (1-12), and Y = the number of the year (for example 1996 or 96).\nThe \"Int\" function in Eq. 25 finds the integer number of the argument in parentheses by rounding downward. The \"Mod(Y,4)\" function finds the modulus (remainder) of the quotient Y/4.\nFor monthly periods, the day of the year at the middle of the month (Jmonth) is approximately:\n)15M4.30(IntJmonth −= (26) The sunset hour angle, ωs, is given by:\n[ ])(tan)(tanarccoss δϕω −= (27) The “arccos” function is the arc-cosine function and represents the inverse of the\ncosine. This function is not available in all computer languages, so that ωs can alternatively be computed using the arc-tangent (inverse tangent) function:\n12 Reference: Allen (2000).\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section\n⎥ ⎦ ⎤ ⎢ ⎣ ⎡− −= 5.0s X )tan()tan(arctan 2 δϕπω (28)\nwhere:\n[ ] [ ] 22 )(tan)(tan1X δϕ−= (29) 0Xif00001.0Xand ≤="
  }, {
    "heading": "Soil Heat Flux Density (G)",
    "text": "Soil heat flux density is the thermal energy utilized to heat the soil. G is positive when the soil is warming and negative when the soil is cooling."
  }, {
    "heading": "For Daily Periods",
    "text": "The magnitude of the daily, weekly or ten-day soil heat flux density, G, beneath a fully vegetated grass or alfalfa reference surface is relatively small in comparison with Rn. Therefore, it is ignored so that:\n0Gday = (30) where:\nGday = daily soil heat flux density [MJ m-2 d-1]."
  }, {
    "heading": "For Monthly Periods",
    "text": "Over a monthly period, G for the soil profile can be significant. Assuming a constant soil heat capacity of 2.0 MJ m-3 °C-1 and an effectively warmed soil depth of 2 m, G for monthly periods in MJ m-2 d-1 is estimated from the change in mean monthly air temperature as:\n)(. ,,, 1imonth1imonthimonth TT070G −+ −= (31)\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section or, if Tmonth,i+1 is unknown:\n)(. ,,, 1imonthimonthimonth TT140G −−= (32) where:\nTmonth,I = mean air temperature of month i [°C], Tmonth,i-1 = mean air temperature of previous month [°C], and Tmonth,i+1 = mean air temperature of next month [°C]."
  }, {
    "heading": "Wind Profile Relationship",
    "text": "Wind speed varies with height above the ground surface. For the calculation of ETsz, wind speed at 2 meters above the surface is required, therefore, wind measured at other heights must be adjusted. To adjust wind speed data to the 2-m height, Eq. 33 should be used for measurements taken above a short grass (or similar) surface, based on the full logarithmic wind speed profile equation B.14 given in Appendix B:\n)42.5z8.67(ln 87.4uu w z2 − = (33)\nwhere:\nu2 = wind speed at 2 m above ground surface [m s-1], uz = measured wind speed at zw m above ground surface [m s-1], and zw = height of wind measurement above ground surface [m].\nFor wind measurements above surfaces other than clipped grass, the user should apply the full logarithmic equation B.14. A special application of Eq. B.14 is given in Appendix B for wind measured above alfalfa or similar vegetation having about 0.5 m height. It is noted that wind speed data collected at heights above 2 m are acceptable for use in the standardized equations following adjustment to 2 m, and may be preferred if vegetation adjacent to the station commonly exceeds 0.5 m. Measurement at a greater height, for example 3m, reduces the influence of the taller vegetation surrounding the weather measurement site.\nASCE-EWRI Task Committee Report, January, 2005 Daily Timestep Section"
  }, {
    "heading": "CALCULATIONS REQUIRED FOR HOURLY TIME-STEPS",
    "text": "Many weather data networks collect and summarize hourly data that allow the user to calculate ETsz for hourly periods. This capability is important where significant shifts in wind and humidity occur hourly. The calculation process for hourly time steps is analogous to that for daily calculations. The hourly equations can be used for shorter time periods, using fractional hours as the time parameter, but care must be taken to multiply the resultant ET rate in mm/h by the fractional hour. For example, if 30-minute data are used, one would input radiation in units of MJ m-2 h-1. Then the output, in mm h-1, would need to be multiplied by 0.5 h to arrive at the ET for the 30-minute period.\nPsychrometric and Atmospheric Variables13"
  }, {
    "heading": "Latent Heat of Vaporization (λ)",
    "text": "The value of the latent heat of vaporization (λ), varies only slightly over the ranges of air temperature that occur in agricultural or hydrologic systems. For ETsz, a constant value of λ = 2.45 MJ kg-1 is selected. The inverse of λ = 2.45 MJ kg-1 is approximately 0.408 kg MJ-1. The density of water (ρw) is taken as 1.0 Mg m-3 so that the inverse ratio of λ ρw times energy flux in MJ m-2 h-1 equals 1.0 mm h-1."
  }, {
    "heading": "Mean Air Temperature (T)",
    "text": "For hourly periods, the mean air temperature, T, represents an average over the period.\n13 Many of the equations presented here are the same as those reported in ASCE Manual 70 (Jensen et al., 1990) and used in FAO-56 (Allen et al., 1998).\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section"
  }, {
    "heading": "Atmospheric Pressure (P)",
    "text": "The mean atmospheric pressure at the weather site is predicted from site elevation using a simplified formulation of the Universal Gas Law14:\n⎟⎟ ⎠ ⎞ ⎜⎜ ⎝ ⎛ 293\nz0.0065-293 5.26 101.3 = P (34)\nwhere:\nP = mean atmospheric pressure at station elevation z [kPa], and z = weather site elevation above mean sea level [m]."
  }, {
    "heading": "Psychrometric Constant (γ)",
    "text": "The standardized application using λ = 2.45 MJ kg-1 results in a value for the\npsychrometric constant, γ, that is proportional to the mean atmospheric pressure:\nP0006650. = γ (35) where P has units of kPa and γ has units of kPa °C-1.\nThe variable γ is not the same variable as γpsy used later in Eqs. 39 and 40 for converting psychrometric data (wet bulb and dry bulb temperature) to vapor pressure."
  }, {
    "heading": "Slope of the Saturation Vapor Pressure-Temperature Curve (∆)",
    "text": "The slope of the saturation vapor pressure-temperature curve15, ∆, is computed as:\n( )2237.3+T\n237.3+T\nT17.27 exp 2503\n= ⎟⎟ ⎠\n⎞ ⎜⎜ ⎝ ⎛\n∆ (36)\nwhere:\n14 Reference: Burman et al. (1987) 15 References: Tetens (1930), Murray (1967)\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\n∆ = slope of the saturation vapor pressure-temperature curve [kPa °C-1], and T = mean air temperature [°C].\nSaturation Vapor Pressure (es) The saturation vapor pressure16, es, represents the capacity of the air to hold water vapor.\nFor calculation of hourly ETsz , es is given by:\n( ) ⎟ ⎠ ⎞ ⎜ ⎝ ⎛ 237.3T+ T 17.27exp 080.61 =Toe =se (37)\nwhere vapor pressure is in units of kPa and T is mean air temperature during the hourly period in °C. eo(T) is the saturation vapor pressure function.\nActual Vapor Pressure (ea ) Actual vapor pressure (ea) is used to represent the water content (humidity) of the air at the weather site. The actual vapor pressure can be measured or it can be calculated from various humidity data, such as measured dew point temperature, wet-bulb and dry-bulb temperature, or relative humidity and air temperature data.\nPreferred procedures for calculating e a When multiple types of humidity or psychrometric data are available for estimating ea, the preferences listed in Table 4 are recommended for calculation method. These recommendations are based on the likelihood that the data will have integrity and that estimates for ea will be representative of the reference ET environment. The availability and quality of local data may justify a different order of preference.\n16 Reference: Jensen et al. (1990) and Tetens (1930)\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nWhen humidity and psychrometric data are missing or are of questionable integrity, dew point temperature can be estimated from daily minimum air temperature as described in Appendix E. This estimation procedure should be verified locally. The assessment of weather data integrity is discussed in Appendix D.\nea from measured dew point temperature\nThe dew point temperature, Tdew, is the temperature to which the air must be cooled to reach a state of saturation. The value for ea is calculated by substituting Tdew into Eq. 37 resulting in:\n( ) ⎥ ⎦ ⎤ ⎢ ⎣ ⎡ + == 3.237T T27.17 exp6108.0Tee dew dew dew o a (38)\nea from psychrometric data\nThe actual vapor pressure can also be determined from the difference between the dry and wet bulb temperatures (i.e., the wet bulb depression) of the air:\n( ) ( )wetdrypsywetoa TTTee −−= γ (39)\nwhere:\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nea = actual vapor pressure of the air [kPa], e°(Twet) = saturation vapor pressure at the wet bulb temperature [kPa] (Eq. 37), γpsy = psychrometric constant for the psychrometer [kPa °C-1], and Tdry-Twet = wet bulb depression, where Tdry is the dry bulb temperature and\nTwet is the wet bulb temperature [°C] (measured simultaneously).\nThe psychrometric constant for the psychrometer at the weather measurement site is given by:\nPa psypsy =γ (40) where:\napsy = coefficient depending on the type of ventilation of the wet bulb [°C1], and P = mean atmospheric pressure [kPa].\nThe coefficient apsy depends primarily on the design of the psychrometer and on the rate of ventilation around the wet bulb. The following values are often used17:\napsy = 0.000662 for ventilated (Asmann type) psychrometers having air movement between 2 and 10 m s-1 for Twet ≥ 0 and 0.000594 for Twet < 0,\n= 0.000800 for naturally ventilated psychrometers with air movement of about 1 m s-1), and = 0.001200 for non-ventilated psychrometers installed in glass or plastic greenhouses (List, 1984).\nea from relative humidity data\nThe actual vapor pressure of air for hourly periods can be calculated from relative humidity (RH) and saturation vapor pressure at the corresponding air temperature (from Eq. 37):\n17 Allen et al., (1998).\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\n)(Te 100 RHe oa = (41)\nwhere:\nRH = mean relative humidity for the hourly period, %, and T = mean air temperature for the hourly period, oC."
  }, {
    "heading": "Net Radiation (Rn )",
    "text": "Net radiation (Rn) is the net amount of radiant energy available at the vegetation or soil surface for evaporating water, heating the air, or heating the surface. Rn includes both short and long wave radiation components 18:\nnlnsn RRR −= (42) where:\nRns = net shortwave radiation, [MJ m-2 h-1] (defined as being positive downwards and negative upwards), Rnl = net outgoing long-wave radiation, [MJ m-2 h-1] (defined as being positive, upwards and negative downwards),\nRns and Rnl are generally positive or zero in value.\nNet radiation is difficult to measure because net radiometers are problematic to maintain and calibrate. There is good likelihood of systematic biases in Rn measurements. Therefore, Rn is often predicted from observed short wave (solar) radiation, vapor pressure, and air temperature. This prediction is routine and generally highly accurate. If Rn is measured, care and attention must be given to the calibration of the radiometer, the surface over which it is located, maintenance of the sensor domes, and level of the instrument. The condition of the vegetation surface is\n18 Reference: Brutsaeart (1982), Jensen et al., (1990), Wright (1982), Doorenbos and Pruitt, (1975, 1977), Allen et al., (1998).\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nas important as the sensor. For purposes of calculating ETsz , the measurement surface for Rn is generally assumed to be clipped grass or alfalfa at full cover."
  }, {
    "heading": "Net Solar or Net Short-Wave Radiation (Rns )",
    "text": "Net short-wave radiation resulting from the balance between incoming and reflected solar radiation is given by:\nsssns R1RRR )( αα −=−= (43) where:\nRns = net solar or short-wave radiation [MJ m-2 h-1], α = albedo or canopy reflection coefficient, is fixed at 0.23 for the standardized short and tall reference surfaces [dimensionless], and Rs = the incoming solar radiation [MJ m-2 h-1].\nThe calculation of ETsz uses the constant value of 0.23 for albedo for daily and hourly periods. It is recognized that albedo varies somewhat with time of day and with time of season and latitude due to change in sun angle. However, because the solar intensity is less during these periods, the error introduced in fixing albedo at 0.23 is relatively small (Allen et al., 1994b). Users may elect to use a different prediction for albedo, however, they are strongly encouraged to ascertain the validity and accuracy of an alternative method using good measurements of incoming and reflected solar radiation. Some types of pyranometers are invalid for measuring reflected radiation due to the difference in spectral response between the instrument and reflecting surface. Predictions of Rn made using an alternate method for albedo (i.e., other than 0.23) may not agree with those made using the ASCE standardized procedure."
  }, {
    "heading": "Net Long-Wave Radiation (Rnl )",
    "text": "There are several variations and coefficients developed for predicting the net long wave component of total net radiation. The standardized ASCE procedure is the\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nsame as that adopted by FAO-56 and is based on the Brunt (1932, 1952) approach for predicting net surface emissivity. If users intend to utilize a different approach for calculating Rn, it is essential to ascertain the validity and accuracy of their method using net radiometers in excellent condition and that are calibrated to some dependable and recognized standard. In all situations, users should compare measured Rn or Rn computed using an alternative method with Rn calculated using the standardized procedure. Substantial variation (more than 5 %) should give cause for concern and should indicate the need to reconcile or justify the differences.\nRnl is the difference between long-wave radiation radiated upward from the standardized surface (Rlu) and long-wave radiation radiated downward from the atmosphere (Rld), so that Rnl = Rlu – Rld. The following calculation for Rnl is the method introduced by Brunt (1932, 1952) that uses near surface vapor pressure to predict net surface emissivity:\n( ) 4 hrKacdnl Te14.034.0fR −σ= (44) where\nRnl = net outgoing long-wave radiation [MJ m-2 h-1], σ = Stefan-Boltzmann constant [ 2.042 x 10-10 MJ K-4 m-2 h-1], fcd = cloudiness function [dimensionless] (limited to 0.05 ≤ fcd ≤ 1.0), ea = actual vapor pressure [kPa], TK hr = mean absolute temperature during the hourly period [K] (K = °C +\n273.16).\nThe superscript “4” in Eq. 44 indicates the need to raise the air temperature, expressed in Kelvin units, to the power of 4. For periods during daytime when the sun is more than about 15o above the horizon (see procedures below), fcd is calculated as:\n35.0 R R 35.1f so s cd −= (45)\nwhere:\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nRs/Rso = relative solar radiation (limited to 0.3 ≤ Rs/Rso ≤ 1.0), Rs = measured or calculated solar radiation [MJ m-2 h-1], and Rso = calculated clear-sky radiation [MJ m-2 h-1].\nThe ratio Rs/Rso in Eq. 45 represents relative cloudiness and is limited to 0.3 < Rs/Rso ≤ 1.0 so that fcd has limits of 0.05 ≤ fcd ≤ 1.0.\nDuring nighttime, Rso, by definition, equals 0, and Eq. 45 is undefined. Furthermore, even small out of level of a pyranometer or imperfect correction for cosine error of the instrument (required for accurate measurement at low sun angle) can cause substantial deviation in the value for Rs/Rso when the sun is near the horizon (i.e., when Rso is small). Therefore, fcd during periods of low sun angle and nighttime is defined using fcd from a prior period having sufficient sun angle.\nWhen sun angle above the horizon (β)19 at the midpoint of the hourly or shorter time period is less than 0.3 radians (~17o), then:\n3.0cdcd ff >β= (46) where:\nfcd β>0.3 = cloudiness function for the time period prior to when sun angle β (in the afternoon or evening) falls below 0.3 radians [dimensionless].\nNote that if the time period is shorter than one hour, fcd from several periods can be averaged into fcd β>0.3 to obtain a representative average value. In mountain valleys where the sun may set near or above 0.3 radians (~17o), the user should increase the sun angle at which fcd β>0.3 is computed and imposed. For example, for a location where mountain peaks are 20o above the horizon, a period should be selected for computing fcd β>0.3 where the sun angle at the end of the time period is 25 to 30o\n19 The sun angle β is defined as the angle of a line from the measurement site to the center of the sun’s disk relative to a line from the measurement site to directly below the sun and tangent to the earth’s surface. This definition assumes a flat surface.\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nabove the horizon. The same adjustment is necessary when deciding when to resume computation of fcd during morning hours when mountains lie to the east.\nOnly one value for fcd β>0.3 is calculated per day for use during dusk, nighttime and dawn periods. That value for fcd β>0.3 is hen applied to the time period when β at the midpoint of the period first falls below 0.3 radians (~15o) and to all subsequent periods until after sunrise when β again exceeds 0.3 radians. Computation of β is given in Eq. 62 in the following section.\nEquations 45 – 46 will not apply at latitudes and times of the year when there are no hourly (or shorter) periods having sun angle of 0.3 radians or greater. These situations occur for latitudes at 50o for about one month per year (in winter), for latitudes at 60o for about 5 months per year, and for latitudes at 70o for about 7 months per year. At extreme latitudes, some fall and winter months have little or no daylight. Under these conditions, the application can average fcd β>0.3 from fewer time periods or, in the absence of any daylight, can assume a ratio of Rs/Rso ranging from 0.3 for complete cloud cover to 1.0 for no cloud cover. Under these extreme conditions, the prediction of Rn during nighttime and low sun angle is only approximate.\nThe application of Eq. 46 presumes that cloudiness during periods of low sun angle and nighttime is similar to that during late afternoon or early evening. This is generally a reasonable assumption and is commensurate with the relative simplicity and moderate accuracy of Eq. 45. Some applications may wish to split the nighttime period into two halves, with the first half using fcd β>0.3 computed from late afternoon or early evening and the second half using fcd β>0.3 computed from Rs measured during the following morning (for the period when β is first > 0.3 radians). However, this additional computation requires looking ahead within a data set and will generally not add accuracy to the computations, since the timing of any shift in cloudiness during nighttime is unknown and due to the general, approximate accuracy of the fcd function (Eq. 45).\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section"
  }, {
    "heading": "Clear-sky solar radiation",
    "text": "Clear-sky solar radiation, Rso, is used in the calculation of net radiation, Rn. Clearsky solar radiation is defined as the amount of solar radiation, Rs, that would be received at the weather measurement site under conditions of clear-sky (i.e., cloudfree). The ratio of Rs to Rso in the equation for Rn is used to characterize the impact of cloud-cover on the downward emission of thermal radiation to the earth’s surface. The value for Rso is a function of the time of year and latitude, and, in addition, the time of day for hourly calculation periods. These parameters affect the potential incoming solar radiation from the sun. Clear-sky solar radiation is also impacted by the station elevation (affecting atmospheric thickness and transmissivity), the amount of precipitable water in the atmosphere (affecting the absorption of some short wave radiation), and the amount of dust or aerosols in the air.\nA daily Rso “envelope” was developed earlier in Figure 1 and compared to measured Rs. For purposes of calculating Rn, hourly Rso can be calculated using the following simple approach:\n( ) a5so Rz102750R −×+= . (47) where:\nRso = clear-sky solar radiation [MJ m-2 h-1], z = station elevation above sea level [m], and Ra = extraterrestrial radiation [MJ m-2 h-1].\nEquation 47 predicts progressively higher levels of clear sky radiation with increasing elevation. Elevation serves as a surrogate for total air mass and atmospheric transmissivity above the measurement site. Equation 47 is generally adequate for use in predicting the ratio Rs/Rso when calculating net radiation, Rn. Other more complex estimates for Rso, which include turbidity and water vapor effects as well as impact of sun angle are discussed in Appendix D. Those equations are recommended\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nfor assessing integrity of solar radiation data and may provide improved estimates for Rso for calculating Rn. The impact on ETsz of using the equations in Appendix D for Rso rather than Eq. 47 will generally be less than a few percent across a day and over an annual period.\nFigure 2 illustrates a comparison of measured hourly solar radiation with Rso computed using Eq. 47 and using the more complicated, but generally more accurate, method presented as Eq. D.1-D.5 of Appendix D. Data from two days in late June are plotted. June 19 had some morning and mid-day cloudiness. June 20 was a cloudfree day. The Rs data from June 20 compare relatively well with both Rso methods throughout the day. The measured data plot slightly higher than either Rso estimate at mid-day, with the more complicated Rso method from Appendix D having better agreement than Eq. 48. Measured Rs exceeded the Rso curves for the 1100 reading on June 19 because of reflection from clouds near the weather site. In general, the solar radiation data appear to be of excellent quality and calibration.\n0\n1\n2\n3\n4\nS ol\nar R\nad ia\ntio n,\nM J/\nm 2/\nh\n0 600 1200 1800 0 600 1200 1800 0\nDay of Year\nMeasured Eq. 47 Kb + Kd\nParma, Idaho\nJune 19, 20, 1998\nFigure 2. Measured and calculated hourly Rso for two days at Parma, Idaho during 1998 using Eq. 47 and using the more accurate KB + KD method of Appendix D.\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nExtraterrestrial radiation for hourly periods (Ra )20\nExtraterrestrial radiation, Ra, defined as the short-wave solar radiation in the absence of an atmosphere, is a well-behaved function of the day of the year, time of day, latitude, and longitude. For hourly time periods, the solar time angle at the beginning and end of the period serve as integration endpoints for calculating Ra:\n([ ])sin()sin()cos()cos()sin()sin()(dG12R 1212rsca ω−ωδϕ+δϕω−ωπ= ) (48)\nwhere\nRa = extraterrestrial radiation during the hour (or shorter) period [MJ m-2 hour-1], Gsc = solar constant = 4.92 MJ m-2 h-1, dr = inverse relative distance factor (squared) for the earth-sun [unitless], δ = solar declination [radians], ϕ = latitude [radians], ω1 = solar time angle at beginning of period [radians], and ω2 = solar time angle at end of period [radians].\nThe latitude, ϕ, expressed in radians is positive for the Northern Hemisphere and negative for the Southern Hemisphere. The conversion from decimal degrees to radians is given by:\n( reesdegdecimal 180 Radians )π= (49) and dr and δ are calculated as:\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ π+= J 365 2cos033.01dr (50)\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ − π =δ 39.1J 365 2sin409.0 (51)\n20 Reference: Duffie and Beckman (1980).\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nwhere J is the number of the day in the year between 1 (1 January) and 365 or 366 (31 December). The constant 365 in Eqs. 50 and 51 is held at 365 even during a leap year. J can be calculated as21:\n⎟ ⎠ ⎞ ⎜ ⎝ ⎛ ⎟ ⎠ ⎞ ⎜ ⎝ ⎛ ⎟ ⎠ ⎞ ⎜ ⎝ ⎛ 0.975 + 4 4) Y, Mod( - 100 M Int + 1 + M 3Int 2 + 9 M 275 Int + 32 - D = J M (52)\nwhere:\nDM = the day of the month (1-31), M = the number of the month (1-12), and Y = the number of the year (for example 1996 or 96).\nThe \"Int\" function in Eq. 52 finds the integer number of the argument in parentheses by rounding downward. The \"Mod(Y,4)\" function finds the modulus (remainder) of the quotient Y/4.\nThe solar time angles at the beginning and end of each period are given by:\n24\nt1 1 π ωω −= (53)\n24\nt1 2 π ωω += (54)\nwhere:\nω = solar time angle at the midpoint of the period [radians], and tl = length of the calculation period [hour]: i.e., 1 for hourly periods or\n0.5 for 30-minute periods.\nThe solar time angle at the midpoint of the period is:\n[ 12SLL066670t 12 cmz\n−+−+= ))(.(πω ]\n(55)\nwhere:\n21 Reference: Allen (2000)\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nt = standard clock time at the midpoint of the period [hour] (after correcting time for any daylight savings shift). For example for a period between 1400 and 1500 hours, t = 14.5 hours, Lz = longitude of the center of the local time zone [expressed as positive degrees west of Greenwich, England]. In the United States, Lz = 75, 90, 105 and 120° for the Eastern, Central, Rocky Mountain and Pacific time zones, respectively, and Lz = 0° for Greenwich, 345° for Paris (France), and 255° for Bangkok (Thailand), Lm = longitude of the solar radiation measurement site [expressed as positive degrees west of Greenwich, England], and Sc = seasonal correction for solar time [hour].\nBecause ωs is the sunset hour angle and -ωs is the sunrise hour angle (noon has ω = 0), values of ω < -ωs or ω > ωs from Eq. 55 indicate that the sun is below the horizon, so that, by definition, Ra and Rso are zero and their calculation has no meaning. When the values for ω1 and ω2 span the value for -ωs or for ωs, this indicates that sunrise or sunset occurs within the hourly (or shorter) period. In this case, the integration limits for applying Eq. 48 should be correctly set using the following conditionals:\nIf ω1 < -ωs then ω1 = -ωs If ω2 < -ωs then ω2 = -ωs (56) If ω1 > ωs then ω1 = ωs If ω2 > ωs then ω2 = ωs If ω1 > ω2 then ω1 = ω2\nThe above conditionals can be applied for all timesteps to insure numerical stability of the application of Eq. 48 as well as correctly computing the theoretical quantity of solar radiation early and late in the day. The user should recognize that Eqs. 48-56 and 62 presume an extensive, flat ground surface and are based on a vector to the center of the sun’s disk. The calculations do not account for diffuse radiation occurring shortly before sunrise and shortly after sunset. Where there are hills or mountains, the hour angle when the sun first appears or disappears may increase for sunrise or decrease for sunset.\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nThe seasonal correction for solar time is:\n)bsin(025.0)bcos(1255.0)b2sin(1645.0Sc −−= (57)\n364\n81J2b )( −= π (58)\nwhere J is the number of the day in the year and b has units of radians.\nThe sunset hour angle, ωs, is given by:\n[ ])(tan)(tanarccoss δϕω −= (59)\nThe “arccos” function is the arc-cosine function and represents the inverse of the\ncosine. This function is not available in all computer languages, so that ωs can alternatively be computed using the arc tangent (inverse tangent) function:\n⎥ ⎦ ⎤ ⎢ ⎣ ⎡− −= 5.0s X )tan()tan(arctan 2 δϕπω (60)\nwhere:\n[ ] [ ] 22 )(tan)(tan1X δϕ−= (61) 0Xif00001.0Xand ≤=\nThe user should confirm accurate setting of the datalogger clock. If clock times are in error by more than 5-10 minutes, estimates of extraterrestrial and clear sky radiation may be significantly impacted. This can lead to errors in estimating Rn on an hourly or shorter basis, especially early and late in the day. A shift in “phase” between measured Rs and Rso predicted from Ra according to the data logger clock can indicate error in the reported time. More discussion is given in Appendix D.\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nThe angle of the sun above the horizon, β, at the midpoint of the hourly or shorter time period is computed as: [ )cos()cos()cos()sin()sin(arcsin ]ωδϕ+δϕ=β (62) where\nβ = angle of the sun above the horizon at midpoint of the period [radians], ϕ = latitude [radians], δ = solar declination [radians], ω = solar time angle at the midpoint of the period [radians] (from Eq.\n55).\nThe “arcsin” function is the arc-sine function and represents the inverse of the sine. This function is not available in all computer languages, so that β can alternatively be computed using the arc tangent (inverse tangent) function:\n( ) ⎥\n⎥\n⎦\n⎤\n⎢ ⎢ ⎣\n⎡\n− =β 5.02Y1\nYarctan (63)\nwhere:\n)cos()cos()cos()sin()sin(Y ωδϕ+δϕ= (64)\nand all other parameters are defined following Eq. 62."
  }, {
    "heading": "Soil Heat Flux Density (G)",
    "text": "Soil heat flux density is the thermal energy that is utilized to heat the soil. G is positive when the soil is warming and negative when the soil is cooling. For hourly calculation periods, G beneath a dense cover of grass or alfalfa does not correlate well with air temperature, but can be significant. Hourly G generally correlates well with net radiation and amount of vegetative cover and can be approximated as a fraction of\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nRn. The following equations are based on Eq. B.13 of Appendix B for fixed vegetation height and leaf area index22.\nFor the standardized short reference ETos :\nndaytimehr R1.0G = (65a) nnighttimehr R5.0G = (65b)\nwhere G and Rn have the same measurement units (MJ m-2 h-1 for hourly or shorter time periods). For the standardized tall reference ETrs :\nndaytimehr R04.0G = (66a) nnighttimehr R2.0G = (66b)\nFor standardization, nighttime is defined as when measured or calculated hourly net radiation Rn is < 0 (i.e., negative). When the soil is warming, the soil heat flux density, G, has a positive value. The amount of energy consumed by G is subtracted from Rn when estimating ETos or ETrs."
  }, {
    "heading": "Wind Profile Relationship",
    "text": "Wind speed varies with height above the ground surface. For the calculation of ETsz, wind speed at 2 meters above the surface is required, therefore, wind measured at other heights must be adjusted. To adjust wind speed data to the 2-m height, Eq. 68 should be used for measurements above a short grass (or similar) surface, based on the full logarithmic wind speed profile equation B.14 given in Appendix B.\n)42.5z8.67(ln 87.4uu w z2 − = (67)\nwhere\nu2 = wind speed at 2 m above ground surface [m s-1], uz = measured wind speed at zw m above ground surface [m s-1], and\n22 Leaf area index (LAI) is defined as the area (one-sided) of leaves per unit area of ground surface. Units are dimensionless (i.e., m2 m-2)\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section\nzw = height of wind measurement above ground surface [m].\nFor wind measurements above surfaces other than clipped grass, the user should apply the full logarithmic equation B.14. A special application of Eq. B.14 is given in Appendix B for wind measured above alfalfa or similar vegetation having about 0.5 m height. It is noted that wind speed data collected at heights above 2 m are acceptable for use in the standardized equations following adjustment to 2 m, and may be preferred if vegetation adjacent to the station commonly exceeds 0.5 m. Measurement at a greater height, for example 3 m, reduces the influence of the taller vegetation.\nNegative Values Computed for ET sz\nValues calculated for reference ET for nighttime hours occasionally take on negative values. In practice, the user may wish to set negative values to zero before summing over the 24-hour period. However, in some situations, negative hourly computed ETos or ETrs may indicate some condensation of vapor during periods of early morning dew and should therefore be registered as negative during the summing of 24-hour ET. In other situations, negative hourly ETos or ETrs during nighttime reflect the uncertainties in some parameter estimates including Rn and assumptions implicit to the combination equation. The impact of negative hourly values on ET summed over daily periods is usually less than a few percent. In general, it may be appropriate to retain the negative values.\nASCE-EWRI Task Committee Report, January, 2005 Hourly Timestep Section"
  }, {
    "heading": "DEFINITION AND APPLICATION OF CROP COEFFICIENTS",
    "text": "Calculation of crop evapotranspiration (ETc) requires the selection of the appropriate crop coefficient (Kc) for use with the standardized reference evapotranspiration (ETos or ETrs). It is recommended that the abbreviation for crop coefficients developed for use with ETos be denoted as Kco and the abbreviation for crop coefficients developed for use with ETrs be denoted as Kcr. ETc is calculated as:\nETc = Kco * ETos or ETc = Kcr * ETrs (68)"
  }, {
    "heading": "TRANSFER AND CONVERSION OF CROP COEFFICIENTS",
    "text": "Crop coefficients (Kc) and landscape coefficients available in the literature are referenced to either clipped, cool season grass or full-cover alfalfa. Without appropriate adjustment, crop coefficients for the two references are not interchangeable. For this standardization effort, a grass reference crop is defined as an extensive, uniform surface of dense, actively growing, cool-season grass with a height of 0.12 m, and not short of soil water. A full-cover alfalfa reference crop is defined here as an extensive, uniform surface of dense, actively growing alfalfa with a height of 0.50 m, and not short of soil water.\nGrass-based crop coefficients should be used with ETos, and alfalfa-based coefficients should be used with ETrs. If a calculated or measured reference other than ETos or ETrs was used to develop the crop coefficients, it must be established that the reference equation or reference measurements provide values that are equivalent to ETos or ETrs (see Appendix A for comparisons between selected methods). It is important to establish the differences between ET equations since some equations developed to estimate grass or alfalfa reference ET may not agree exactly with ETos or ETrs during all time periods or under all climatic conditions.\nASCE-EWRI Task Committee Report, January, 2005\nKc values that can be used with ETos without adjustment include those reported in FAO-56 (Allen et al., 1998) and ASCE Manual 70 (Jensen et al., 1990, Table 6.8). Coefficients that can be used as is with ETos for most practical applications are those reported by FAO-24 (Doorenbos and Pruitt, 1977) and SCS NEH Part 623 Chapter 2 (Martin and Gilley, 1993). Coefficients based on the CIMIS Penman equation (Snyder and Pruitt, 1992) should not require adjustment for use with ETos. Kc values that can be used as is with ETrs for most practical applications are those reported by Wright (1982) and ASCE Manual 70 (Jensen et al., 1990, Tables 6.6 and 6.9). There is a tendency for relatively minor overestimation of ET using Kc from Wright (1982) with ETrs in spring and fall. Thus, the Kc values by Wright (1981, 1982) have been converted for direct use with ETrs, with ETrs calculated on a 24-h time step (Allen and Wright, 2002).\nSome grass and alfalfa based crop coefficients are “mean” crop coefficients (e.g., Wright, 1979; 1981; Doorenbos and Pruitt, 1977). Mean crop coefficients incorporate the effects of irrigation, rainfall, and soil type at the development site. Users of these mean crop coefficients are cautioned that differences in irrigation frequency, rainfall patterns, and/or soil drying characteristics between the development site and the study site could cause error in the ETc estimate.\nThe publications referenced in the above paragraphs contain descriptions on determination and application of crop coefficients during growing periods. This information will not be presented here. The following section discusses the application of ETsz and Kc during non-growing periods.\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "CALCULATION OF REFERENCE EVAPOTRANSPIRATION DURING",
    "text": ""
  }, {
    "heading": "NON-GROWING PERIODS",
    "text": "During cold periods in many regions, freezing temperatures preclude vegetation from remaining green and actively growing. These periods are referred to as non-growing periods. Evapotranspiration from non-active vegetation during non-growing periods is generally less than reference ET because plants may be dormant and therefore may have substantially increased surface resistance. Besides surface resistance, albedo or reflectance of dormant or dead vegetation is generally greater than that of green vegetation. Both of these characteristics reduce the potential rate of ET from plant residue. This may make it difficult to assess the validity of reference ET equations under these conditions.\nWhile it is recognized that the reference ET equations do not represent measurable quantities during non-growing periods, the ETsz equation can still be useful as an evaporative index. However, the user must be aware that conditions for the reference surfaces for ETos and ETrs may not exist during non-growing periods. Under many non-growing conditions, it is possible to incorporate the differences between dormant or dead vegetation ET and ETsz into the Kc value. However there are other factors to be considered. For example, the soil heat flux estimates may be uncertain, low sun angles and snow cover will influence albedo, and short day lengths will affect the calculation of net radiation and ETsz for daily time steps.\nIn this document the Task Committee will not recommend a methodology for the application of reference evapotranspiration during non-growing seasons. Two other ASCE Task Committees are investigating evaporative losses during non-growing seasons and are developing estimation methodologies.\nASCE-EWRI Task Committee Report, January, 2005"
  }, {
    "heading": "GLOSSARY OF TERMS",
    "text": ""
  }, {
    "heading": "FOR THE",
    "text": ""
  }, {
    "heading": "ASCE STANDARDIZED REFERENCE EVAPOTRANSPIRATION",
    "text": ""
  }, {
    "heading": "EQUATION",
    "text": "Cd denominator constant that changes with reference type and calculation time step (s m-1) Cn numerator constant that changes with reference type and calculation time step (K mm s3 Mg-1 d-1 or K mm s3 Mg-1 h-1) DM day of the month (1-31) ET Evapotranspiration (mm d-1 or mm h-1) ETc Crop evapotranspiration ETos Reference ET for a short crop with an approximate height of 0.12 m (similar to clipped grass) (mm d-1 or mm h-1) ETref Reference Evapotranspiration (mm d-1 or mm h-1) ETrs Reference ET for a tall crop with an approximate height of 0.50 m (similar to full-cover alfalfa) (mm d-1 or mm h-1) ETsz Standardized Reference Evapotranspiration Equation G soil heat flux density at the soil surface (MJ m-2 d-1 for daily time steps or MJ m-2 h-1 for hourly time steps) Gday daily soil heat flux density (MJ m-2 d-1) Ghr daytime hourly soil heat flux density during daytime (MJ m-2 h-1) Ghr nighttime hourly soil heat flux density during nighttime (MJ m-2 h-1) Gmonth monthly soil heat flux density (MJ m-2 d-1) Gsc solar constant (4.92 MJ m-2 h-1) J day of the year (1 – 365) Jmonth month of the year (1 –12) Kab coefficient derived from the as and bs coefficients of the Angstrom formula (unitless) KB the clearness index for direct beam radiation (unitless) Kc crop coefficient Kco crop coefficient for use with ETos Kcr crop coefficient for use with ETrs KD the transmissivity index for diffuse radiation (unitless) KG coefficient used to calculate hourly soil heat flux (unitless) Kt atmospheric turbidity coefficient (unitless) Ktime units conversion, equal to 86,400 s d-1 for ET in mm d-1 and equal to 3600 s h-1 for ET in mm h-1 Ko average difference between Tmin and mean daily Tdew (oC)\nASCE-EWRI Task Committee Report, January, 2005\nLAI leaf area index = area (one-sided) of leaves per unit area of ground surface (m2 m-2) LAIactive active (sunlit) leaf area index, m2 (leaf area) m-2 (soil surface) Lm longitude of the measurement site (expressed as positive degrees west of Greenwich, England) Lz longitude of the center of the local time zone (expressed as positive degrees west of Greenwich, England) M number of the month (1-12) N maximum duration of sunshine or daylight hours (h) P atmospheric pressure at station elevation z (kPa) Po atmospheric pressure at sea level = 101.3 (kPa) R specific gas constant = 287 (J kg-1 K-1) Ra extraterrestrial radiation (MJ m-2 d-1) or (MJ m-2 h-1) RH relative humidity (%) RHmax daily maximum relative humidity (%) RHmean mean daily relative humidity RHmin daily minimum relative humidity (%) Rlu long-wave radiation emitted from the surface Rld long-wave radiation emitted from the atmosphere Rn net radiation at the crop surface (MJ m-2 d-1 or MJ m-2 h-1 ) Rnl net long-wave radiation (MJ m-2 d-1 or MJ m-2 h-1 ), defined as being positive upwards and negative downwards Rns net short-wave radiation (MJ m-2 d-1 or MJ m-2 h-1 ), defined as being positive downwards and negative upwards Rs measured or calculated solar radiation (MJ m-2 d-1) or (MJ m-2 h-1) Rso clear-sky radiation (MJ m-2 d-1) or (MJ m-2 h-1) Sc seasonal correction for solar time (h) T mean daily or hourly air temperature at 1.5 to 2.5-m height (°C) Tdew dew point temperature (oC) Tdry dry bulb temperature (°C) Thr mean hourly air temperature (°C) TK mean absolute temperature (K) TK hr mean absolute temperature during the hour (K) TKo reference temperature at elevation zo (K) TK max maximum absolute temperature during the 24-hour period (K) TK min minimum absolute temperature during the 24-hour period (K) TKv mean virtual temperature for period (K) Thr mean hourly air temperature (°C) Tmax daily maximum air temperature (°C) Tmean mean air temperature for the time period of calculation (oC) Tmin daily minimum air temperature (°C) Tmonth monthly mean air temperature (°C) Twet wet bulb temperature (°C) W precipitable water in the atmosphere (mm)\nASCE-EWRI Task Committee Report, January, 2005\nY number of the year (for example 1996 or 96) apsy coefficient depending on the type of ventilation of the wet bulb of a psychrometer (°C-1) as coefficient of the Angstrom formula (unitless) bs coefficient of the Angstrom formula (unitless) cp specific heat of the air, (MJ kg-1 oC-1) d zero plane displacement height, (m) daytime hourly or shorter period when Rn ≥ 0 dr inverse relative distance earth-sun (unitless) e mean actual vapor pressure at 1.5 to 2.5-m height (kPa) a eo(T) saturation vapor pressure function (kPa) es saturation vapor pressure at 1.5 to 2.5-m height (kPa) fcd cloudiness function (unitless) fcd β>0.3 cloudiness function for the time period prior to when sun angle β (in the afternoon or evening) falls below 0.3 radians (unitless) g gravitational acceleration = 9.807 (m s-2) h reference vegetation height (m) k von Karman's constant, 0.41, (dimensionless) kRs adjustment coefficient for predicting Rs from air temperature (°C-0.5) n recorded duration of sunshine during a day (h) nighttime hourly or shorter period when Rn < 0 ra aerodynamic resistance (s m-1) rl bulk stomatal resistance of a well-illuminated leaf (s m-1) rs surface resistance (s m-1) t standard clock time at the midpoint of the period tl length of the calculation period (h) u2 mean daily or hourly wind speed at 2-m height (m s-1) uz wind speed at height z (m s-1) z weather site elevation above mean sea level (m) zh height of air temperature and humidity measurements (m) zo elevation at reference level (i.e., sea level) (m) zom roughness length governing momentum transfer (m) zoh roughness length for transfer of heat and vapor (m) zw height corresponding to wind speed (m) α ”alpha” = albedo or canopy reflection coefficient (unitless) αl constant lapse rate moist air = 0.0065 (K m\n-1) β “beta” = angle of the sun above the horizon (radians) γ “gamma” = psychrometric constant (kPa °C-1) γpsy psychrometric constant for the psychrometer (kPa °C-1) ∆ “delta” = slope of the saturation vapor pressure-temperature curve (kPa °C-1) δ “delta” = solar declination (radians)\nASCE-EWRI Task Committee Report, January, 2005\nε “epsilon” = ratio of the molecular weight of water vapor to dry air (unitless) (ε = 0.622) λ “lambda” = latent heat of vaporization (MJ/kg) ϕ “phi” = latitude (radians) ρa “rho” = air density (Kg m-3) ρw water density (Mg m-3) (taken as 1.0 Mg m-3) σ “sigma” = Stefan-Boltzmann constant ( 4.901 10-9 MJ K-4 m-2 d-1) ω “omega” solar time angle (radians), solar noon = 0. ωs sunset hour angle (radians) ω1 solar time angle at beginning of hourly or shorter period (radians) ω2 solar time angle at end of hourly or shorter period (radians)\nASCE-EWRI Task Committee Report, January, 2005"
  }],
  "year": 2005,
  "references": [{
    "title": "Evaluation of procedures for estimating mean monthly solar radiation from air temperature.",
    "authors": ["R.G. Allen"],
    "venue": "Rep. submitted to Water Resources Dev. and Mgmt Service, Land and Water Dev. Div., United Nations Food and Agriculture",
    "year": 1995
  }, {
    "title": "Assessing integrity of weather data for use in reference evapotranspiration estimation.",
    "authors": ["R.G. Allen"],
    "venue": "J. Irrig. and Drain. Engrg.,",
    "year": 1996
  }, {
    "title": "A self-calibrating method for estimating solar radiation from air temperature.",
    "authors": ["R.G. Allen"],
    "venue": "J. Hydrol. Engrg,",
    "year": 1997
  }, {
    "title": "REF-ET, “Reference Evapotranspiration Calculator Version Windows 1.0.",
    "authors": ["R.G. Allen"],
    "year": 1999
  }, {
    "title": "REF-ET, Reference Evapotranspiration Calculator Version Windows 2.0.",
    "authors": ["G. R"],
    "venue": "Univ. of Idaho Res. and Ext. Center, Kimberly, ID,",
    "year": 2000
  }, {
    "title": "Effects of projected CO2 - induced climatic changes on irrigation water requirements in the Great Plain States (Texas, Oklahoma, Kansas, and Nebraska).” The potential effects of global climate change on the United States: Appendix C",
    "authors": ["R.G. p. Allen", "F.N. Gichuki"],
    "venue": "Univ. of Idaho Res. and Ext",
    "year": 1989
  }, {
    "title": "Rational use of the FAO Blaney-Criddle formula.",
    "authors": ["R.G. Allen", "W.O. Pruitt"],
    "venue": "J. Irrig. and Drain. Engrg.,",
    "year": 1986
  }, {
    "title": "FAO-24 reference evapotranspiration factors.",
    "authors": ["R.G. Allen", "W.O. Pruitt"],
    "venue": "J. Irrig. and Drain. Engrg.,",
    "year": 1991
  }, {
    "title": "Estimating Soil Heat Flux for Reference Evapotranspiration.",
    "authors": ["R.G. Allen", "J.L. Wright"],
    "venue": "Unpublished paper, Univ. Idaho R&E Ctr., Kimberly, Idaho 83341.,",
    "year": 1996
  }, {
    "title": "Translating wind measurements from weather stations to agricultural crops.",
    "authors": ["R.G. Allen", "J.L. Wright"],
    "venue": "J. Hydrologic Engrg, ASCE",
    "year": 1997
  }, {
    "title": "Conversion of Wright (1981) and Wright (1982) alfalfa-based crop coefficients for use with the ASCE Standardized PenmanMonteith Reference Evapotranspiration Equation.",
    "authors": ["R.G. Allen", "J.L. Wright"],
    "year": 2002
  }, {
    "title": "Weather station siting and consumptive use estimates.",
    "authors": ["R.G. Allen", "C.E. Brockway", "J.L. Wright"],
    "venue": "J. Water Resour. Plng. and Mgmt. Div.,",
    "year": 1983
  }, {
    "title": "Operational estimates of reference evapotranspiration.",
    "authors": ["R.G. Allen", "M.E. Jensen", "J.L. Wright", "R.D. Burman"],
    "venue": "Agron. J.,",
    "year": 1989
  }, {
    "title": "An update for the definition of reference evapotranspiration.",
    "authors": ["R.G. Allen", "M. Smith", "A. Perrier", "L.S. Pereira"],
    "venue": "ICID Bulletin",
    "year": 1994
  }, {
    "title": "An update for the calculation of reference evapotranspiration.",
    "authors": ["R.G. Allen", "M. Smith", "L.S. Pereira", "A. Perrier"],
    "venue": "ICID Bulletin",
    "year": 1994
  }, {
    "title": "Crop Evapotranspiration: Guidelines for computing crop water requirements.",
    "authors": ["R.G. Allen", "L.S. Pereira", "D. Raes", "M. Smith"],
    "year": 1998
  }, {
    "title": "Issues, requirements and challenges in selecting and specifying a standardized ET equation.",
    "authors": ["R.G. Allen", "I.A. Walter", "R. Elliott", "B. Mecham", "M.E. Jensen", "D. Itenfisu", "T.A. Howell", "R. Snyder", "P. Brown", "S. Eching", "T. Spofford", "M. Hattendorf", "R.H. Cuenca", "J.L. Wright", "D. Martin"],
    "year": 2000
  }, {
    "title": "An approximation formula to compute relative humidity from dry bulb and dew point temperatures.",
    "authors": ["J.F. Bosen"],
    "venue": "Monthly Weather Rev 86(12):486",
    "year": 1958
  }, {
    "title": "Stability of calibration of inexpensive polystyrene relative humidity sensors under field conditions.",
    "authors": ["P.W. Brown", "S.A", "Musil", "B.T. Russell"],
    "year": 1987
  }, {
    "title": "Personal communication to ASCE Task Committee for Standardization of Reference Evapotranspiration.",
    "authors": ["P.W. Brown"],
    "year": 2001
  }, {
    "title": "Notes on radiation in the atmosphere: I.",
    "authors": ["D. Brunt"],
    "venue": "“Physical and Dynamical Meteorology”,",
    "year": 1932
  }, {
    "title": "Evaporation into the Atmosphere.",
    "authors": ["W. Brutsaert"],
    "venue": "D. Reidel Pub. Co., Boston,",
    "year": 1982
  }, {
    "title": "Changes in climate and estimated evaporation across a large irrigated area in Idaho.",
    "authors": ["R.D. Burman", "J.L. Wright", "M.E. Jensen"],
    "year": 1975
  }, {
    "title": "Thermodynamic factors in evapotranspiration.\" p. 28-30",
    "authors": ["R.D. Burman", "M.E. Jensen", "R.G. Allen"],
    "venue": "Proc., Irrig. and Drain. Spec",
    "year": 1987
  }, {
    "title": "Estimating evaporation and carbon assimilation using infrared temperature data: vistas in modeling.",
    "authors": ["B.J. Choudhury"],
    "venue": "Theory and Applications of Optical Remote Sensing,",
    "year": 1989
  }, {
    "title": "Analysis of an empirical model for soil heat flux under a growing wheat crop for estimating evaporation by an infrared temperature based energy balance equation.",
    "authors": ["Choudhury", "B.J.S.B. Idso", "R.J. Reginato"],
    "venue": "Agr. and For",
    "year": 1987
  }, {
    "title": "Estimation of net radiation over well-watered grass",
    "authors": ["A. Dong", "S.R. Grattan", "J.J. Carroll", "C.R.K. Prashar"],
    "venue": "J. of Irrig. and Drain. Engrg., ASCE 118 (3):466479.",
    "year": 1992
  }, {
    "title": "Solar Engineering of Thermal Processes.",
    "authors": ["J.A. Duffie", "W.A. Beckman"],
    "year": 1980
  }, {
    "title": "Alfalfa Reference ET Measurement and Prediction.",
    "authors": ["S.R. Evett", "T.A. Howell", "R.W. Todd", "A.D. Schneider", "J.A. Tolk"],
    "venue": "Proc., 4 National Irrig. Symp.,",
    "year": 2000
  }, {
    "title": "Comparison testing of selected naturally ventilated solar radiation shields",
    "authors": ["G.C. Gill"],
    "venue": "Final Rpt Contract # NA-82-0A-A-266.”",
    "year": 1983
  }, {
    "title": "Estimating potential evapotranspiration.",
    "authors": ["G.H. Hargreaves", "Z.A. Samani"],
    "venue": "Tech. Note, J. Irrig. and Drain. Engrg.,",
    "year": 1982
  }, {
    "title": "Reference crop evapotranspiration from temperature.",
    "authors": ["G.H. Hargreaves", "Z.A. Samani"],
    "venue": "Appl. Eng. in Agr.,",
    "year": 1985
  }, {
    "title": "Agricultural benefits for Senegal River Basin.",
    "authors": ["G.L. Hargreaves", "G.H. Hargreaves", "J.P. Riley"],
    "venue": "J. Irrig. and Drain. Engrg.,",
    "year": 1985
  }, {
    "title": "Fundamental concepts and definitions relating to humidity.",
    "authors": ["L.P. Harrison"],
    "venue": "Humidity and Moisture",
    "year": 1963
  }, {
    "title": "A Texas Sized Test of the ASCE ET Equation.",
    "authors": ["T.A. Howell"],
    "venue": "Royce Tipton Lecture, Amer. Soc. of Civil Engr. USDA-ARS,",
    "year": 1998
  }, {
    "title": "Automated weather data collection for research in irrigation scheduling.",
    "authors": ["T.A. Howell", "D.W. Meek", "C.J. Phene", "K.R. Davis", "R.L. McCormick"],
    "year": 1984
  }, {
    "title": "Irrigated fescue grass ET compared with calculated reference grass ET.",
    "authors": ["T.A. Howell", "S.R. Evett", "A.D. Schneider", "D.A. Dusek", "K.S. Copeland"],
    "venue": "Proc., 4 National Irrig. Symp.,",
    "year": 2000
  }, {
    "title": "Comparison of reference evapotranspiration calculations across a range of climates.",
    "authors": ["D. Itenfisu", "R.L. Elliott", "R.G. Allen", "I.A. Walter"],
    "venue": "p. 216-227,",
    "year": 2000
  }, {
    "title": "Comparison of Reference Evapotranspiration Calculations as a Part of the ASCE Standardization Effort",
    "authors": ["Itenfisu", "D.R.L. Elliott", "R.G. Allen", "I.A. Walter."],
    "venue": "J. Irrig. and Drain.",
    "year": 2003
  }, {
    "title": "Evapotranspiration and Irrigation Water Requirements.",
    "authors": ["M.E. Jensen", "R.D. Burman", "R.G. Allen (ed"],
    "venue": "ASCE Man. and Rep. on Engineering Pract. No. 70,",
    "year": 1990
  }, {
    "title": "Weather station siting effects on reference evapotranspiration.” p 727-734, Proc., Evapotranspiration and Irrigation Scheduling",
    "authors": ["T.W. Ley", "R.G. Allen", "R.W. Hill"],
    "year": 1996
  }, {
    "title": "Smithsonian Meteorological Tables”, 6 ed., Smithsonian Institution, Washington",
    "authors": ["R.J. List"],
    "year": 1984
  }, {
    "title": "Prediction of direct solar radiation for low atmospheric turbidity.",
    "authors": ["N.C. Majumdar", "B.L. Mathur", "S.B. Kaushik"],
    "venue": "Solar Energy",
    "year": 1972
  }, {
    "title": "Irrigation Water Requirements,” Chapter 2, Part 623, National Engrg",
    "authors": ["D.L. Martin", "J. Gilley."],
    "venue": "Handbook, USDA, Soil Conservation Service, 284.",
    "year": 1993
  }, {
    "title": "Data Quality Checking for Single Station Meteorological Databases.",
    "authors": ["D.W. Meek", "J.L. Hatfield"],
    "venue": "Agric. and Forest Meteorol",
    "year": 1994
  }, {
    "title": "Evaporation and the environment.",
    "authors": ["J.L. Monteith"],
    "year": 1965
  }, {
    "title": "Evaporation and surface temperature.",
    "authors": ["J.L. Monteith"],
    "venue": "Q. J. Roy. Meteorol",
    "year": 1981
  }, {
    "title": "On the computation of saturation vapor pressure.",
    "authors": ["F.W. Murray"],
    "venue": "J. Appl. Meteorol.,",
    "year": 1967
  }, {
    "title": "Natural evaporation from open water, bare soil and grass.",
    "authors": ["H.L. Penman"],
    "venue": "Proc. Roy.Soc. London",
    "year": 1948
  }, {
    "title": "Estimating evaporation.",
    "authors": ["H.L. Penman"],
    "venue": "Trans. Am. Geophys. Union,",
    "year": 1956
  }, {
    "title": "Vegetation and hydrology",
    "authors": ["H.L. Penman"],
    "venue": "Tech. Comm. No. 53, Commonwealth Bureau of Soils, Harpenden, England. 125 pp.",
    "year": 1963
  }, {
    "title": "Empirical Calibration, a requisite for evapotranspiration formulae based on daily or longer mean climatic data?",
    "authors": ["Pruitt", "W.O.. amd Doorenbos. J"],
    "venue": "Int. Round Table Conf. On",
    "year": 1977
  }, {
    "title": "Quality assurance procedures in the Oklahoma Mesonetwork",
    "authors": ["M.A. Shafer", "C.A. Fiebrich", "D.S. Arndt."],
    "venue": "J. Atmospheric. and Oceanic. Tech. 17: 474-494.",
    "year": 2000
  }, {
    "title": "Report of the expert consultation on procedures for revision of FAO guidelines for prediction of crop water requirements.",
    "authors": ["M. Smith", "R.G. Allen", "J.L. Monteith", "A. Perrier", "L. Pereira", "A. Segeren"],
    "venue": "Food and Agriculture Organization of the United Nations,",
    "year": 1991
  }, {
    "title": "PMDay.xls and PMhr.xls spreadsheet software for estimating daily or hourly reference evapotranspiration using the Penman-Monteith equation.",
    "authors": ["R.L. Snyder"],
    "venue": "Dept. Land, Air and Water Resources,",
    "year": 2000
  }, {
    "title": "Estimating Reference Evapotranspiration with Hourly Data",
    "authors": ["Snyder", "R.L", "W.O. Pruitt."],
    "venue": "VII-1-VII-3.” R. Snyder, D. W. Henderson, W. O., Pruitt, and A. Dong (eds), Calif. Irrig. Mgmt. Systems, Final Rep., Univ. Calif., Davis.",
    "year": 1985
  }, {
    "title": "Evapotranspiration Data Management in California",
    "authors": ["R.L. Snyder", "W.O. Pruitt."],
    "venue": "Presented at the Am. Soc. Civil Engr. Proc. Water Forum ‘92’, Aug. 2-6, 1992, Baltimore, MD.",
    "year": 1992
  }, {
    "title": "An automated weather station network for estimation of evapotranspiration.",
    "authors": ["R.L. Snyder", "W.O. Pruitt", "A. Dong"],
    "venue": "Crop Water",
    "year": 1985
  }, {
    "title": "A guide to automated agricultural weather station networks in North America.",
    "authors": ["R.L. Snyder", "P.W. Brown", "K.G. Hubbard", "S.J. Meyer"],
    "venue": "In: G. Stanhill (ed.). Advances in Bioclimatology",
    "year": 1996
  }, {
    "title": "Accuracy of Global Radiation Measurement at Unattended Automated Weather Stations.",
    "authors": ["G. Stanhill"],
    "venue": "Agric. and Forest Meteorol",
    "year": 1992
  }, {
    "title": "Evolution of Automated Weather Station Technology though the 1980s",
    "authors": ["B.D. Tanner"],
    "year": 2001
  }, {
    "title": "Uber einige meteorologische Begriffe.",
    "authors": ["O. Tetens"],
    "venue": "Z. Geophys.,",
    "year": 1930
  }, {
    "title": "An evaluation of common evapotranspiration equations.",
    "authors": ["F. Ventura", "D. Spano", "P. Duce", "R.L. Snyder"],
    "venue": "Irrig. Sci",
    "year": 1999
  }, {
    "title": "Irrigation Association Request for a Benchmark Evapotranspiration Equation",
    "authors": ["I.A. Walter", "R.L. Elliott."],
    "venue": "Letter to T. H. Kimmel, Irrigation Association.",
    "year": 2000
  }, {
    "title": "ASCE’s Standardized Reference Evapotranspiration Equation.",
    "authors": ["I.A. Walter", "Allen", "R. G", "R. Elliott", "M.E. Jensen", "D. Itenfisu", "B. Mecham", "T.A. Howell", "R. Snyder", "P. Brown", "S. Eching", "T. Spofford", "M. Hattendorf", "R.H. Cuenca", "J.L. Wright", "D. Martin"],
    "year": 2000
  }, {
    "title": "Recent developments in determining crop coefficient values.",
    "authors": ["J.L. Wright"],
    "venue": "Irrig. and Drain. Div. Spec. Conf. ASCE,",
    "year": 1979
  }, {
    "title": "Crop Coefficient for Estimates of Daily Crop Evapotranspiration.",
    "authors": ["Wright", "James L"],
    "venue": "Proc. Am. Soc. Agric. Engrs., Irrig. Scheduling Conf.,",
    "year": 1981
  }, {
    "title": "New Evapotranspiration Crop Coefficients.",
    "authors": ["J.L. Wright"],
    "venue": "J. Irrig. and Drain. Div.,",
    "year": 1982
  }, {
    "title": "Personal comm",
    "authors": ["L. Wright J."],
    "venue": "to ASCE Committee of Irrigation Water Requirements.”",
    "year": 1987
  }, {
    "title": "Daily and seasonal evapotranspiration and yield of irrigated alfalfa in southern Idaho.",
    "authors": ["J.L. Wright"],
    "venue": "Agron. J.,",
    "year": 1988
  }, {
    "title": "Derivation of alfalfa and grass reference evapotranspiration.",
    "authors": ["J.L. Wright"],
    "year": 1996
  }, {
    "title": "Peak water requirements of crops in Southern Idaho.",
    "authors": ["J.L. Wright", "M.E. Jensen"],
    "venue": "J. Irrig. and Drain. Div., ASCE,",
    "year": 1972
  }, {
    "title": "Conversion between evapotranspiration references and methods.",
    "authors": ["J.L. Wright", "R.G. Allen", "T.A. Howell"],
    "venue": "p. 251-259,",
    "year": 2000
  }],
  "id": "SP:704d3efb8a5ce1b54e93c6d8666defc230951706",
  "authors": [{
    "name": "Ronald Elliott",
    "affiliations": []
  }, {
    "name": "Daniel Itenfisu",
    "affiliations": []
  }, {
    "name": "Paul Brown",
    "affiliations": []
  }, {
    "name": "Marvin E. Jensen",
    "affiliations": []
  }, {
    "name": "Brent Mecham",
    "affiliations": []
  }, {
    "name": "Terry A. Howell",
    "affiliations": []
  }, {
    "name": "Richard Snyder",
    "affiliations": []
  }, {
    "name": "Richard G. Allen",
    "affiliations": []
  }, {
    "name": "Ivan A. Walter",
    "affiliations": []
  }, {
    "name": "Terry Howell",
    "affiliations": []
  }, {
    "name": "Marvin Jensen",
    "affiliations": []
  }],
  "abstractText": "This report describes the standardization of calculation of reference evapotranspiration (ET) as recommended by the Task Committee on Standardization of Reference Evapotranspiration of the Environmental and Water Resources Institute of the American Society of Civil Engineers. The purpose of the standardized reference ET equation and calculation procedures is to bring commonality to the calculation of reference ET and to provide a standardized basis for determining or transferring crop coefficients for agricultural and landscape use. The basis of the standardized reference ET equation is the ASCE Penman-Monteith (ASCE-PM) method of ASCE Manual 70. For the standardization, the ASCE-PM method is applied for two types of reference surfaces representing clipped grass (a short, smooth crop) and alfalfa (a taller, rougher agricultural crop), and the equation is simplified to a reduced form of the ASCE–PM. Standardized calculations for vapor pressure, net radiation and wind speed adjustment are recommended for application to hourly and daily calculation time steps. Guidelines on assessing weather data integrity and estimating values for missing data are provided. ASCE-EWRI Task Committee Report, January, 2005 ASCE Standardized Reference Evapotranspiration Equation Page iii THE ASCE STANDARDIZED REFERENCE EVAPOTRANSPIRATION EQUATION Task Committee on Standardization of Reference Evapotranspiration",
  "title": "THE ASCE STANDARDIZED REFERENCE EVAPOTRANSPIRATION EQUATION"
}